[
  {
    "filename": "ACCREDITATION STATUS.docx",
    "chunk": 0,
    "content": "ACCREDITATION STATUS The UE Graduate School has seven accredited programs: Master in Education, Level II; and Doctor of Education, Doctor of Business Administration, Master of Arts in Education, Master of Library and Information Sciences, Master in Public Administration, and Master of Business Administration, all Level II Reaccredited (all effective December 2016 to November 2019). Two other GS programs, Master of Science in Construction Management and Master in Information Management, are on Candidate Status (May 2016 to May 2018). The UE College of Arts and Sciences– Caloocan has three accredited programs: AB Communication Arts, Level III Reaccredited (effective April 2015 to May 2017) BS Tourism Management, Level I Accredited BS Hotel and Restaurant Management, Level I Accredited (both effective December 2016 to November 2019) The UE College of Engineering-Caloocan has six accredited programs: BS Computer Engineering, Level III Reaccredited Status (April 2015 to May 2017); BS in Electrical Engineering, Level II Reaccredited (January 2015 to May 2017); BS Mechanical Engineering, Level II Reaccredited (January 2015 to May 2017); BS in Civil Engineering, Level II Reaccredited (January 2015 to May 2017); BS Information Technology, Level I Accredited; BS Computer Science, Level I Accredited Status (the latter two both effective December 2016 to November 2019) Philippine Accrediting Association of Schools, Colleges and Universities (PAASCU) Level II Philippine Accrediting Association of Schools, Colleges and Universities (PAASCU) Level II Keinaz N. Domingo (First Filipino in International Council of E-Commerce Consultants Global Ethical Hacking Leaderboard) The UE College of Fine Arts, Architecture and Design’s Bachelor of Fine Arts major in Advertising Arts and Painting program is Level I Accredited (December 2016 to November 2019) BS Interior Design is on Candidate status (January 2015 to November 2016) Under CAS Caloocan, the UE Basic Education Department Basic Education program is Level I Accredited (December 2016 to November 2019)"
  },
  {
    "filename": "ADMISSIONS.docx",
    "chunk": 0,
    "content": "ADMISSION UE CALOOCAN COURSES OFFERED CBA Caloocan College of Business Administration-Caloocan Bachelor of Science in Accountancy (BSA) nce in Management Bachelor of Science Accounting (BSMA) Bachelor of Science in Business Administration (BSBA) Major Financial Management Marketing Management, Business Management. CASCaloocan College of Arts and Sciences-Caloocan Bachelor of Arts in Communication (BA Comm) Bachelor of Bachelor of Science in Hospitality Management (BSHM) Science in Tourism Management (BSTM) Psychology (BS Psych) Bachelor of Science Bachelor of Arts in in Communication (BA Comm) with Specialization in Digital Communication and Creative Media Bachelor of Science in Criminology with Specialization in Cyber Security New CEng'gCaloocan College of Engineering-Caloocan Bachelor of Science in Civil Engineering (BSCE) Bachelor of Science in Computer Engineering (BSCPE) Bachelor of Science in Electrical Engineering (BSEE) Bachelor of Science in Electronics Engineering (BSECE) Bachelor of Science in Mechanical Engineering (BSME) Bachelor of Science in Computer Science (BSCS) Bachelor of Science in Information Technology (BSIT) Bachelor of Science in Data Science (BSDS) CFAD College of Fine Arts, Architecture and Design Bachelor of Fine Arts (BFA) Major in: Visual Communication (Advertising Arts), Painting Bachelor of Multimedia Arts (BMMA) Bachelor of Science in Architecture (BS Arch) Bachelor of Science in Interior Design (BSID) UE MANILA 2219 C. M. Recto Avenue, Brgy. 404, Zone 41, Sampaloc, Manila, Philippines 1008 8-735-5471 local 398 or 399 or 5-328-5471 local 398 or 399 admission@ue.edu.ph UE CALOOCAN 105 Samson Road, Brgy. 80, Caloocan City, Philippines 1400 5-328-4572 local 160 or 5-310-4548 admissions. caloocan(@ue.edu.ph UE RAMON MAGSAYSAY MEMORIAL MEDICAL CENTER, INC. (UERMMMCI) 64-68 Aurora Boulevard, Brgy. Doña Imelda, Quezon City, Philippines 1113 8-715-0861 local 205 or 8-254-4119 admission@uerm.edu.ph www.ue.edu.ph"
  },
  {
    "filename": "Board of Trustees.docx",
    "chunk": 0,
    "content": "University of the East – Board of Trustees Chairman of the Board and Chief Executive Officer : LUCIO C. TAN Vice Chairman: DAVID O. CHUA Members : ZOSIMO M. BATTADCORAZON S. DE LA PAZ-BERNARDOFE C. ENRILE-BACSALESTER A. GARCIARAMON B. MAGSAYSAY JR.DIOSDADO M. PERALTAVIVIENNE K. TANJUANITA T. TAN LEEDANTE O. TINGAWILSON T. YOUNG Corporate Officers LUCIO C. TANChairman of the Board DAVID O. CHUAVice Chairman ZOSIMO M. BATTADPresident JUANITA T. TAN LEETreasurer DIVINOFIEL E. JARASCorporate Secretary Academic Officers ZOSIMO M. BATTADPresident and Chief Academic Officer LOUIE A. DIVINAGRACIAChancellor, Manila Campus VICTOR R. MACAM JRChancellor, Caloocan Campus ALBERTO T. PAALA JRDean, Graduate School VIVIANA M. PAGUIRIGANDean, College of Law ILUMINADA L. VILORIADean, College of Dentistry GARY C. DYDean, College of Arts and Sciences – Manila MICHELLE H. CONCEPCIONDean, College of Arts and Sciences – Caloocan ROSALINDA B. LACERONADean, College of Business Administration – Manila EMETERIA B. DALISAYDean, College of Business Administration – Caloocan MA. TERESA F. BOREBORDean, College of Computer Studies and Systems EVA AURORA D. CALLUENGDean, College of Education ROGELIO B. ANIEZ JRDean, College of Engineering – Manila ANGELITA D. GUIADean, College of Engineering-Caloocan DON S. AMORSOLODean, College of Fine Arts, Architecture and Design GERARDO V. VENTURINAPrincipal, Basic Education Department – Manila MARILOU S. ALONZOPrincipal, Basic Education Department – Caloocan ——————————————————————————————————————————————————————— MARCELO E. VERGARAUniversity Registrar, Department of Registration and Records Management VENUS B. ORUGADirector, Department of Libraries ELOIDA C. DAGUMBOYDirector, Admissions Office LYDIA R. LEONARDODirector, Office of Research Coordination LEO ROBERT B. VIAJAR Director, Department of Physical Education EDILINA B. BALDOZADirector, Student Affairs Office – Manila CLEMENTE A. DIWASDirector, Student Affairs Office – Caloocan GENEROSO A. CARINGALDirector, Office of Cultural Affairs ROGELIO I. ESPIRITUDirector, Office of Extension and Community Outreach MA. GRACE G. GONZALESDirector, Guidance, Counseling and Career Services Office YONARDO A. GABUYODirector, Office for Quality Assurance, andExpanded Tertiary Education Equivalency and Accreditation Program Center MELVIN A. VIDARDirector, Office of Curriculum Development and Instruction DARWIN M. GUIANANDirector, Office for International Affairs and External Linkages Administrative Officers LUCIO C. TANChairman of the Board and Chief Executive Officer DAVID O. CHUAVice Chairman FLORENCE O. SIYSenior Vice President for Finance and Administration ANNIE J. VILLEGASVice President for Finance OMAR T. OSINDirector for Administrative Services SARAH JANE C. MACAHILASUniversity Legal Counsel GHERMAN G. JARAMILLODirector, Information Technology Department LARRY G. TOBIAS JR.Budget Officer REDENTOR D. GIRONELLAComptroller MARILOU P. SANTOSDirector, Department of Human Resources and Development BOBBY RJ V. PAKINGANInternal Auditor JOSE AMANTE A. MOOGPurchasing Officer YOLANDA"
  },
  {
    "filename": "Board of Trustees.docx",
    "chunk": 1,
    "content": "M. DAZOUniversity Cashier EDILBERTO B.SULAT JRDirector, Marketing and University Relations Department"
  },
  {
    "filename": "Brief history of the University of the East.docx",
    "chunk": 0,
    "content": "Brief history of the University of the East The roots of the University of the East can be traced back to two rented rooms on Dasmarinas Street, Manila, where 110 students enrolled in Certified Public Accountant (CPA) review classes in September 1946, barely two months after the Philippines acquired its independence. Led by Dr. Francisco T. Dalupan Sr., the group of business educators that initiated the classes made it their objective to help the country, then still reeling from the effects of war. Out of the 110 students, four made it to top places in the CPA board examinations in 1947. Encouraged by this initial success, Dr. Dalupan and his colleagues opened the Philippine College of Commerce and Business Administration (PCCBA) along R. Papa St. in Sampaloc, Manila, to 350 students in the summer of 1947. The following year, as more students enrolled and more academic units were organized, the PCCBA moved to what is now the main campus on Claro M. Recto Avenue. The PCCBA was granted university status on July 3, 1951 and was renamed the University of the East, with Dr. Dalupan as President and Chairman of the Board of Trustees.The first members of the Board were Herminigildo B. Reyes, businessman, scholar and former Vice President of the University of the Philippines; Santiago F. de la Cruz, CPA and business executive who later succeeded Dr. Dalupan as President; Jose L. Torres, soldier, businessman and accountant; and Jaime Hernandez, the first ever Filipino Auditor General of the then Government Auditing Office (GAO), now the Commission on Audit (COA) who later became the Secretary of Finance. The succeeding years were a period of rapid growth for UE. More Colleges-Law, Medicine and Engineering-and the Graduate School of Education were opened. The Graduate School of Education later on fused with the Graduate School of Business Administration to become the UE Graduate School. In June 1954, Dr. Dalupan and his associates opened a vocational and technical training center in Caloocan (then known as UE Tech) on a 4.86-hectare lot along Samson Road, Caloocan. Now called UE Caloocan (Caloocan itself is now a city), it is now an academically autonomous campus and headed by a Chancellor. The Caloocan Campus’ Tan Yan Kee Academic Building houses the Colleges of Arts and Sciences-Caloocan, Business Administration-Caloocan and Fine Arts. The College of Engineering-Caloocan has its own building on the Campus. The UE Caloocan grounds had been"
  },
  {
    "filename": "Brief history of the University of the East.docx",
    "chunk": 1,
    "content": "used for ROTC and CAT instruction since 1986. In 1955, the University purchased a one-hectare lot along Aurora Boulevard in Quezon City. On it was established the College of Medicine. Two years later, on May 17, 1957 , the College was converted into a Foundation and named the UE Ramon Magsaysay Memorial Medical Center (UERMMMC). In 1962 the University acquired a 5,850-square meter lot across the Medical Center along Aurora Boulevard . This became the Research Center for Sciences, Humanities and Culture. It had two buildings. One housed the School of Music and Arts and the Ballet School ; the other, the College of Dentistry and research laboratories. The School of Music and Arts, now the College of Fine Arts , eventually moved to the Caloocan Campus in 1981. The College of Dentistry also moved to the Recto Campus in SY 1988-1989. Simultaneous with the University’s expansion in facilities was its rapid growth in enrollment. From the original 110 students in 1946, the student population steadily grew each year until 1960, when UE became the first Philippine university to break the enrollment mark of 60,000. The highest enrollment record was achieved during the first semester, SY 1975-1976, with 67,443 students registered. The economic crisis and recession that ravaged the country in the 1980s did not spare UE. The devaluation of the peso, inflation, the cost of wages, and faculty, personnel and student strikes affected UE and enrollment declined. This period intensified into a crisis that almost led to the school’s being sold to a foreign religious group. Financial troubles and academic decline continued to burden UE through the Eighties, prompting Dr. Isidro D. Carino, who became President in 1984, to apply very stringent measures. These included personnel reduction, cost-cutting measures and renting out of school premises and facilities in short-term and long-term leases. UE offered innovative courses, such as the ladder type of curriculum, a special course for executives, the Institute for Computer Studies and Systems-now the College of Computer Studies and Systems or CCSS-and scholarships for accounting and engineering students. The lease of facilities enabled UE to hold back tuition fee increases in SYs 1986-1987 and 1987-1988. When Dr. Carino was appointed Secretary of Education in 1990, and under the auspices of benefactor Lucio C. Tan, Panfilo O. Domingo, a UE CBA alumnus and the former President of the Philippine National Bank, took over as UE’s Chairman of the"
  },
  {
    "filename": "Brief history of the University of the East.docx",
    "chunk": 2,
    "content": "Board of Trustees and Chief Executive Officer and concurrent Acting President. A management expert, Chairman Domingo set about curing the financial ills of the University by retiring its short-term debts and instituting fiscal and operational reforms. In 1992, Dr. Rosalina S. Cajucom, a UE CBA alumna and former Treasurer of the Philippines, became the President of UE-replacing Dr. Arturo Q. Trinidad, who was UE President from 1991 to 1992. Upon President Cajucom’s retirement in mid-1995, Chairman Domingo again assumed the presidency until the appointment of Dr. Josefina R. Cortes to the position in 1997. Upon President Cortes’ retirement in 2003, Mr. Baltazar N. Endriga, a UE CBA Manila alumnus, succeeded her as President, his UE presidency running from August 2003 to July 2005. Chairman Domingo was once again the concurrent President from September 2005 up to January 2006, when Dr. Ester Albano Garcia, former Chairperson of the Commission on Higher Education (CHED), was appointed UE President. Within five years, the University’s loans were substantially reduced and the long-accumulated operating deficit was eliminated from the books. At the same time, Chairman Domingo embarked on a massive rehabilitation of the institution’s infrastructure and academics. By the fourth quarter of 1999, under Chairman Domingo, the UE Board of Trustees authorized the retirement of the University’s remaining bank obligations in full, rendering UE totally debt-free After Chairman Domingo passed away on June 26, 2008, at age 83, Dr. Lucio C. Tan assumed the position of Chairman of the Board and CEO of the University."
  },
  {
    "filename": "College of Arts and Science Course Information.docx",
    "chunk": 0,
    "content": "College of Arts and Science Course Information/Curricular Offering – Caloocan Campus Bachelor of Arts programs: Bachelor of Arts in Broadcasting Bachelor of Arts in International Studies Bachelor of Arts in Political Science Bachelor of Science programs: Bachelor of Science in Legal Management Bachelor of Science in Psychology Bachelor of Science in Biology (Medical Biology Track) Bachelor of Science in Biology (Ecology and Biodiversity Track) Bachelor of Science in Hospitality Management The course trains tomorrow’s professional managers of hotels and restaurants. It produces globally competitive professionals in the world’s biggest and fastest growing industry – tourism. It specifically prepares students for job prospects that include the following: Hotel manager Restaurant manager Front desk manager Executive chef Guest relations coordinator Food and beverage manager Housekeeping manager Operations manager Bachelor of Science in Tourism Management The course trains tomorrow’s tourism professionals here and abroad. It produces globally competitive professionals in the world’s biggest and fastest growing industry – tourism. It specifically prepares students for job prospects that include the following: Travel account representative Tour coordinator Local tourism officer Airline flight attendant Tour escort Staff of the Department of tourism and other tourism-related institutions"
  },
  {
    "filename": "College of Business Administration Course Information.docx",
    "chunk": 0,
    "content": "College of Business Administration Course Information/Curriculum Offering – Caloocan Campus BACHELOR OF SCIENCE IN ACCOUNTANCY (BSA) A four-year curricular program that provides general accounting education to students wanting to pursue a professional career in accountancy in general and in public accounting in particular. This program complies with CMO No. 27 series of 2017, qualifying the graduate to take assessments leading to certifications in Accountancy given by the Board of Accountancy and other global professional Accountancy organizations. PROGRAM EDUCATIONAL OBJECTIVES (PEO) for BSA The UE BSA Program envisions its graduates to: Actively engage in any of the four sectors of the Accounting profession, namely Academe, Commerce and Industry, Government, and Public Practice; Develop an awareness and knowledge of the role of ethics in the accounting profession and in accounting business practices, and adhere to the Professional Code of Ethics in the practice of the Accountancy profession; Work effectively as individuals or as a team to accomplish tasks in multi-disciplinary and multi-cultural teams in the national and global settings; Continuously acquire and maintain professional competence through related work experience and continuing professional development (CPD); Adhere to the core values of integrity, professionalism, teamwork, transparency, accountability and social responsibility; and Render valuable community service and outreach through various extension services. PROGRAM OUTCOMES FOR BSA A UE graduate of Bachelor of Science in Accountancy should be able to: Resolve business issues and problems, with global and strategic perspective using knowledge and technical proficiency in the areas of financial accounting and reporting, cost accounting and management, accounting and control, as well as taxation and accounting information systems; Conduct accountancy research through independent studies of relevant literature and appropriate use of accounting theory and methodologies; Employ technology as a business tool in capturing financial and non-financial information, generating reports and making decisions; Apply knowledge and skills that will enable them to successfully respond to various types of assessments (including professional licensure and certifications); and Confidently maintain a commitment to good corporate citizenship, social responsibility and ethical practice in performing functions as an accountant. Career Opportunities The field of accounting offers stimulating and challenging work that is constantly evolving. The BSA program seeks to prepare the student for a general accounting career and eventual entry to any of the four major fields of accountancy: public practice, commerce and industry, government, and education. A.Entry-level jobs Public Practice: Junior Auditor/Audit Staffer, Tax Staffer, Consulting Staffer Commerce and Industry: Cost"
  },
  {
    "filename": "College of Business Administration Course Information.docx",
    "chunk": 1,
    "content": "Analyst, Investment Analyst, Financial Accounting and Reporting Staffer, Management Accounting Staffer, Tax Accounting Staffer, Internal Audit Staffer, Financial Analyst, Budget Analyst, Credit Analyst, Cost Accountant. Government: State Accounting Examiner, NBI Agent, Treasury Agent, State Accountant, LGU Accountant, Revenue Officer, Audit Examiner, Budget Officer, Financial Services Specialist Education: Junior Accounting Instructor B. Middle-level positions Public Practice: Audit Supervisor, Senior Audit Manager, Senior Tax Manager, Senior Consulting Manager/Financial Advisory Manager Commerce and Industry: Comptroller, Senior Information Systems Auditor, Senior Loan Officer, Senior Fraud Examiner, Senior Forensic Auditor Government: State Accountant V, Director III and Director IV, Government Accountancy and Audit, Financial Services Manager, Audit Services Manager, Senior Auditor Education: Accredited Accounting Teacher, Program or Department Chair C. Advanced positions Public Practice: Partner, Senior Partner, Senior Consultant/Financial Advisor Commerce and Industry: Chief Financial Officer, Chief Information Officer Government: National Treasurer, Vice President for Finance/CFO (for GOCCs), Commissioner, Associate Commissioner, Assistant Commissioner (COA, BIR, BOC) Education: Associate Dean, Dean. Bachelor of Science in Business Administration (BSBA) BUSINESS MANAGEMENT (BME) A curricular program designed for students who seek immediate employment in the field of business management, to help them develop managerial know-how and become valuable assets to any company. Instruction in this program provides a balanced curriculum of general education and business-related subjects. THE OBJECTIVES OF THE PROGRAM: Equip the students with knowledge of the principles and concepts of management, such as planning, organizing, staffing, leading and controlling; Communicate effectively in both oral and written English; Demonstrate competence in the use of information technology; Display professional skills that will prepare students for immediate employment and for lifelong learning in the areas of management and functional areas of business (marketing, accounting, finance, human resources management, production and operation management, and information technology); Guide the students in organizing or managing entrepreneurial activities if they decide to be self-employed; Prepare students to pursue a teaching career or graduate studies in business; and Adhere to the values of integrity, professionalism, teamwork, transparency, accountability and social responsibility in the practice of their profession. PROGRAM OUTCOMES A graduate of the program should be able to: Apply the basic concepts, principles and theories of Business Management in real-world situations; Organize and manage activities in manufacturing and service-related businesses; Develop competitive skill as managers; Prepare for gainful employment and facilitate the integration process in the corporate environment so that they can be immediately productive once employed; Apply the proper decision tools to critically,"
  },
  {
    "filename": "College of Business Administration Course Information.docx",
    "chunk": 2,
    "content": "analytically and creatively solve problems and see desired results; Convey ideas clearly in both oral and written English, using the language of business to be responsive to the rapidly changing environment and for global competitiveness; Effectively and efficiently use information and communication technology; and Demonstrate corporate citizenship and social responsibility, and exercise high personal moral and ethical standards. Career Opportunities Administrative Assistant Any Supervisory or Managerial job of specialization, government and private Benefits Assistant Compensation Assistant Entrepreneur/Recruitment Assistant Executive Assistant Human Resource Assistant Training and Development Officer BUSINESS ECONOMICS (BBE) A curricular program that prepares the graduates for careers in banking, economic and development planning, as well as general management. The program focuses on the relationship of business operations and the economy as a whole. It integrates economic principles and strategies into standard business practices so that the student can have both the micro view of how the business can acquire capital, generate profit and efficiently produce goods and services, as well as the macro view of how external economic factors such as government regulation can affect, and should influence, business decisions. THE OBJECTIVES OF THE PROGRAM: Equip students with insights and understanding of economic principles and theories; Prepare the students to be aware and responsive to the present economic issues affecting the business environment; Develop in the students competencies and skills needed as economic analysts or entrepreneurs; Prepare the students to pursue a teaching career or graduate studies in business; Produce business and economic researches to detect early signs of opportunities and threats that may affect courses of action; and Adhere to the values of integrity, professionalism, teamwork, transparency, accountability and social responsibility in the practice of their profession. PROGRAM OUTCOMES A graduate of the program will be able to: Demonstrate an understanding of business intelligence, including the importance of data gathering, data string, data analyzing and accessing data; Analyze the business environment for strategic direction; Produce business and economic researchers that will contribute in solving economic and social problems; Utilize results of data analysis to organizational stakeholders at various levels; Prepare operational plans; Innovate business ideas based on emerging industries; Manage strategic business units for economic stability; Choose the best approach in modern decision-making and problem-solving; Apply business analytics tools to solve business problems, to aid intelligent and informed business decision-making for business optimization; and Render relevant and committed service to the community, the nation and the world."
  },
  {
    "filename": "College of Business Administration Course Information.docx",
    "chunk": 3,
    "content": "CAREER OPPORTUNITIES Analytics Manager Business Analytics Specialist Corporate Planning Analyst Data Scientist Economist Financial Advisor Operations Analyst Planning and Budget Analyst (Public and Private Sectors) Political Advisor Quality Assurance Analyst Research Assistant Site Analyst (website analytics) Statistician FINANCIAL MANAGEMENT (BFM) A curricular program that prepares the graduates for various careers in financial management as well as in related fields, including but not limited to, corporate finance, investment management, banking, credit, trust operations, insurance, foreign currency markets, money markets, capital markets, and other financial securities markets. The curriculum provides the graduate with knowledge on financial institutions and technical skills based on established financial theories, methodologies, and various analytical tools. It also promotes an outlook that is based primarily on ethics, market integrity, regulations, good governance and competitive global perspective, necessary for effective financial decision-making. THE OBJECTIVES OF THE PROGRAM: Complete understanding of the concepts, principles and the theories of Financial Management; Develop an understanding of the external environment which affects financial institutions and business organizations; Help the students seek employment and assume entry-level jobs or positions of responsibility as financial analyst, financial manager, or executive; Prepare the students to pursue a teaching career or graduate studies in business. Design business research through the utilization of financial tools; Draw sound decision using analytical tools and perspectives in the analysis of financial reports; and Adhere to the values of integrity, professionalism, teamwork, transparency, accountability and social responsibility in the practice of their profession. PROGRAM OUTCOMES A graduate of the program should be able to: Demonstrate understanding in financial analysis, including the ability to calculate financial ratio; Analyze the business financial environment for strategic direction; Prepare financial strategic management; Committed services to the community; Evaluate the impact of financial decisions on strategic directions; and Analyze financial issues. CAREER OPPORTUNITIES Associate Financial Manager Entrepreneur Insurance Underwriter Financial Analyst Financial Security Dealer, Broker and Underwriter Financial Manager New Account Personnel in Banks Risk and Credit Analyst Treasury Assistant Treasurer and Finance Officer MARKETING MANAGEMENT (BMM) A curricular program that prepares the graduates for careers in marketing, market research, advertising and public relations. The curriculum provides the graduate with both technical skills and competencies required in the field, as well as flexible mindset necessary to stay competitive in a constantly changing business environment. THE OBJECTIVES OF THE PROGRAM: Equip students with knowledge of the principles and concepts of marketing; Recognize global marketing in the context of its"
  },
  {
    "filename": "College of Business Administration Course Information.docx",
    "chunk": 4,
    "content": "role in the country’s economic development with regard to the 21st century; Guide the students in organizing or managing entrepreneurial activities if they decide to be self-employed; Prepare students to pursue a teaching career or graduate studies in business; Prepare and defend market research and critique output; Help the students to seek employment and entry level jobs or positions of responsibility as marketing manager, marketing executive or marketing director; and Adhere to the values of integrity, professionalism, teamwork, transparency, accountability and social responsibility in the practice of their profession. BACHELOR OF SCIENCE IN MANAGEMENT ACCOUNTING (BSMA) A curricular program that provides general accounting education to students wanting to pursue a professional career in management accounting. This program complies with CMO No. 28 series of 2017, qualifying the graduate to take assessments leading to certifications in management accounting given by global professional management accounting organizations. PROGRAM EDUCATIONAL OBJECTIVES (PEO) for BSMA The UE BSMA Program envisions its graduates to: Become competent and ethical professional accountants capable of making positive contributions over their lifetimes to the profession and society in which they work; Develop professional skills and professional values, ethics and attitudes throughout their professional lives; Cover a number of different technical or strategic positions in their professional lives; Contribute to planning, controlling and performance evaluation and be able to recommend to the top management courses of action that would fulfill their strategic goals; and Reflect on the ethical implications of their job, which also implies addressing the question of to whom they respond through their actions and decisions. PROGRAM OUTCOMES FOR BSMA A UE graduate of Bachelor of Science in Management Accounting should be able to: Resolve business issues and problems, with a global and strategic perspective using their knowledge and technical proficiency in the areas of financial accounting and reporting, cost accounting and management, management accounting and control, taxation and accounting information systems; Conduct management accounting research through independent studies of relevant literature and appropriate use of accounting theory and methodologies; Employ technology as a business tool in capturing financial and non-financial information, generating reports and making decisions; Apply knowledge and skills that will enable them to successfully respond to various types of assessment (including professional licensure and certifications); and Confidently maintain a commitment to good corporate citizenship, social responsibility and ethical practice in performing functions as an accountant. CAREER OPPORTUNITIES The field of accounting offers stimulating and challenging work"
  },
  {
    "filename": "College of Business Administration Course Information.docx",
    "chunk": 5,
    "content": "that is constantly evolving. The BSMA program seeks to prepare the student for a management accounting career. Specific sample job opportunities are the following: A.Entry-level job Public Practice: Junior Analyst, Consulting Staffer Commerce and Industry: Cost Analyst, Investment Analyst, Management Accounting Staffer, Tax Accounting Staffer, Financial Analyst, Budget Analyst, Credit Analyst, Cost Accountant Government: State Accounting Examiner, NBI Agent, Treasury Agent, State Accountant, LGU Accountant, Revenue Officer, Audit Examiner, Budget Officer, Financial Services Specialist Education: Junior Accounting Instructor B. Middle-level positions Public Practice: Senior Consulting Manager/Financial Advisory Manager Commerce and Industry: Comptroller, Senior Information Systems Auditor, Senior Loan Officer, Senior Budget Officer Government: State Accountant V, Director III and Director IV, Government Accountant and Auditor, Financial Services Manager, Audit Services Manager, Senior Auditor Education: Accredited Accounting Teacher, Program or Department Chair C. Advanced positions Public Practice: Partner, Senior Partner, Senior Consultant/Financial Advisor Commerce and Industry: Finance Director/Chief Financial Officer, Chief Information Officer Government: National Treasurer, Vice President for Finance/CFO (for GOCCs), Commissioner, Associate Commissioner, Assistant Commissioner (COA, BIR, BOC). BSBA, SPECIAL DEGREE PROGRAM A degree program designed specifically for entrepreneurs and/or executives in private enterprises or government, or for officers in the Armed Forces of the Philippines or the Philippine National Police with no baccalaureate degree."
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 0,
    "content": "College of Engineering Course Information/Curricular Offerings – Caloocan Campus Bachelor of Science in Civil Engineering (BSCE) Civil engineering deals with the design,construction and maintenance of physical and naturally built environments, including works such as bridges, roads, canals, dams and buildings. This field is traditionally broken into several subdisciplines, including environmental engineering, geotechnical engineering, structural engineering, transportation engineering, municipal or urban engineering, water sources engineering, materials engineering, coastal engineering, surveying and construction engineering. Civil engineering takes place on all levels: in the public sector from municipal to national levels, and in the private sector from individual home owners to international companies. Career Opportunities Project Manager Project Engineer Structural Engineer Resident Engineer Quantity Surveyor Quality Control Engineer Application Engineer Project Control Executive Site Engineer Planning Engineer Design Engineer Water and Sanitation Engineer UE’s CE Achievements Philippine Association of Colleges and Universities Commission on Accreditation (PACUCOA), Level IIAccredited and Level III Candidate Status, UE’S CE licensure exam topnotchers include Engrs. Ritchie M.Maquiran (8th, November 2017) and Dominic Isidro (2nd, May 2015), among many others. Bachelor of Science in Electrical Engineering (BSEE) Electrical engineering deals with the generation, transmission, distribution and utilization of electricity.It also deals with the design, operation and protection, maintenance and economics of electricalsystems with emphasis on ethical values to harness economically and safely the materials and forces ofnature for the benefit of society and of the environment. Program Educational Objectives Three to five years after graduation, the Electrical Engineering alumni shall:1. have pursued advancement towards Electrical Engineering practice to become a globally competitive Professional Electrical Engineers2. be contributors to the development in the practice of Electrical Engineering both locally and international and to promote high standard of electrical engineering practice for the welfare of the society and the environment. Program Outcomes:By the time of graduation, the students of the program shall have the ability to:a. Apply knowledge of mathematics and sciences to solve complex engineering problems; b. Develop and conduct appropriate experimentation, as well as to analyze and interpret data; c. Design a system, component, or process to meet desired needs within realistic constraints such as economic, environmental, social, political, ethical, health and safety, manufacturability, and sustainability, in accordance with standards; d. Function effectively on multi-disciplinary and multi-cultural teams that establish goals, plan tasks, and meet deadlines; (based on PQF Level 6 descriptor) e. Identify, formulate and solve complex problems in electrical engineering; f. Recognize ethical and professional responsibilities in"
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 1,
    "content": "engineering practice; g. Communicate effectively with a range of audiences; h. Understand the impact of engineering solutions in a global, economic, environmental, and societal context; i. Recognize the need for additional knowledge and engage in life-long learning; j. Articulate and discuss the latest developments in the field of electrical engineering; (PQF Level 6 descriptor) k. Apply techniques, skills and modern engineering tools necessary for electrical engineering practice; and l. Demonstrate knowledge and understanding of engineering and management principles as a member and/or leader in a team to manage projects in a multidisciplinary environment. Electrical Engineering Curriculum The Electrical Engineering curriculum is designed to produce engineers equipped withknowledge in complex mathematics, natural and physical sciences, and engineering fundamentals.General education courses are included to ensure that the graduates knows their role andresponsibilities in society. The Electrical Engineering offers the following specialized track: Track 1: Power System ProtectionTrack 2: Advanced Power System AnalysisTrack 3: Electrical Estimating and AuditingTrack 4: Machine Automation and Process Control Career Opportunities The graduates of Electrical Engineering may go into the following career opportunities : Power Engineer (Power System Operation, Power System Protection, Power System Economics, Power Plant) Design Engineer (Advance Power System, Advance Electrical Designer, Machine Automation and Process Design) Illumination Engineer Entrepreneur Sales Engineer Distribution Engineer System Distribution Engineering Engineering Educator and Researcher Instrumentation and Control Engineer Safety Engineer Maintenance Engineer Construction and Project Engineer Electrical Design Inspector The Laboratory The laboratory equipment in the Electrical Engineering Department provides the necessary in-depth experience and training of students in electrical, electronic and computing equipment as well as experimental techniques and skills in the use of modern laboratories. The Electromechanical Training System equipment of Lab Volt combines a modular design approach with computer-based data acquisition and control to provide unparalleled training in electromechanical systems. This equipment is oriented towards competence requirements which includes electricity fundamentals (i.e., dc power circuits), single-phase and three-phase ac power circuits, power transformers, three-phase transformer banks, dc machines, three-phase rotating machines (induction machine and synchronous machine), and power factor correction. The system features the Dynamometer/Power Supply, and the Data Acquisition and Control Interface, and state-of- the-art USB peripherals that greatly enhance the learning experience of students. The AC Power Transmission Training System equipment of Lab Volt combines a modular design approach with computer-based data acquisition and control to provide unparalleled training in ac power transmissions systems to students having a basic knowledge in power technology"
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 2,
    "content": "(dc power circuits, single-phase ac power circuits, and single-phase power transformers). The system features the Data Acquisition and Control Interface, Model 9063, a state-of-the-art USB peripheral that greatly enhance the learning experience of students. The PLC and Electro-Pneumatics Trainer gives the students a hands-on experienced in programming PLC and integrating it to pneumatic devices and other I/O devices available in this trainer. The students may create their own simulation experiments on the freeware provided by the MELSEC, a Mitsubishi Electric PLC Series and apply the same to this PLC trainer which is powered by the Mitsubishi Electric F-Series. Achievements Philippine Association of Colleges and Universities Commission on Accreditation (PACUCOA), Level I Accredited Bachelor of Science in Computer Engineering (BSCpE) Computer engineering deals with the application of engineering principles and methodologies in the analysis, design, implementation and management of hardware and software, and the integration of both. The Computer Engineering (CpE) Program educates students to understand both sides of the hardware-software interface, from designing circuits to creating operating systems. Multidisciplinary in scope, the CpE curriculum integrates the fields of electrical engineering and computer science. This program will uniquely prepare CpE graduates to design and develop embedded digital and computer systems. Graduates with a degree in CpE will be highly skilled and ideally suited for 21st-century industries, including the games industry. UE CpE concentrates on the practical application of theoretical learning through a variety of semestral and year long projects. Students will have increasing levels of creative control in their projects and receive feedback from expert instructors. Program Educational Objectives Three to five years after graduation, the Computer Engineering alumni shall:1. have pursued advancement towards becoming globally competitive leaders in their chosen field of practice. 2. be contributors to the development of a progressive society, guided by the UE core values of Excellence, Integrity, Professionalism, Teamwork, Commitment, Transparency, Accountability and Social Responsibility. Student Outcomes Ability to apply knowledge of mathematics and science to solve engineering problems. Ability to design and conduct experiments, as well as to analyze and interpret data. Ability to design a system, component or process to meet desired needs within realistic constraints such as economic, environmental, social, political, ethical, health and safety, manufacturability, and sustainability, in accordance with standards. Ability to function in multidisciplinary teams. Ability to identify, formulate and solve engineering problems. Understanding of professional and ethical responsibilities. Ability to communicate effectively. Broad education necessary to understand the"
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 3,
    "content": "impact of engineering solutions in global, economic, environmental and societal contexts. Recognition of the need for and an ability to engage in lifelong learning. Knowledge of contemporary issues. Ability to use techniques, skills and modern engineering tools necessary for engineering practice. Knowledge and understanding of engineering and management principles as a member and leader in a team, to manage projects in multidisciplinary environments. Program Outcomes:By the time of graduation, the students of the program shall have the ability to:a. Ability to apply knowledge of mathematics and sciences to solve complex engineering problems; b. Ability to design and conduct experiments, as well as to analyze and interpret data; c. Ability to design a system, component, or process to meet desired needs within realistic constraints such as economic, environmental, social, political, ethical, health and safety, manufacturability, and sustainability, in accordance with standards; d. Ability to function in multi-disciplinary teams; e. Ability to identify, formulate and solve complex problems in computer engineering problems; f. Understanding of professional and ethical responsibility; g. Ability to communicate effectively; h. Broad education necessary to understand the impact of engineering solutions in global, economic, environmental, and societal context; i. Recognition of the need for, and an ability to engage in life-long learning; j. Knowledge contemporary issues; k. Ability to use techniques, skills and modern engineering tools necessary for computer engineering practice; and l. Knowledge and understand engineering and management principles as a member and leader in a team, and to manage projects and in a multidisciplinary environment. The Computer Engineering Curriculum The CpE curriculum and student projects will focus on embedded systems, a term that refers toany device that uses a microprocessor or microcontroller for a specific purpose. Embedded systemsappear in a wide array of household and industrial systems, and including portable and console gamesystems, robots, game peripherals, electronic toys, digital cameras, audio/video component systems,and even aircraft flight systems. The UE CPE Design And Laboratory Experience The computer engineering program at UE is a balance of engineering science and design. The freshman and sophomore year courses are structured to lay a solid foundation for the junior and senior level design courses by the introduction of courses in hardware, software and the engineering sciences (math, physics, and chemistry). Design methodology and analysis techniques are stressed throughout the curriculum in the majority of the core courses required for graduation. The lecture classes are typically complemented by laboratory experiments that the"
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 4,
    "content": "student has designed, simulated and analyzed before commencing with the actual hands-on construction and testing. Students are well prepared in the software/hardware design procedure when they reach the final classes of Microprocessor System Design and the Senior Project Classes. Skills in both software and hardware are employed in the design of a microcomputer system that require the student to write his own operating system in a high-level language ( e.g. C or C++) with embedded assembly language. The hardware support requirement is the design and implementation of a direct memory access (DMA) controller using a PLD or FPGA and a peripheral interface controller that supports a printer and an external bus. Students have several pattern electives to choose from in advanced software and hardware design classes. Such classes include topics in networks, embedded systems, VHDL, digital signal processing, state machine design, VLSI, control systems, communications and artificial intelligence. The senior project class brings together, in a balance of solid software and hardware skills acquired throughout the required and elective curriculum, a culminating experience which involves teamwork, design, report writing and oral presentation. These experiences prepare our graduates to be successful engineers with an awareness of the many challenges involved in the workplace Applications of computer engineering include: Technology Areas Applications of computer engineering include:Technology Areas• Robotics and Automation• Artificial Intelligence• Operating Systems• Information Systems• Telecommunications• Signal Processing• Control Systems and Instrumentation• Data Analytics• IT Infrastructure• Mobile and Web Applications Application Domains• Multimedia Aerospace and Avionics• Automotive• Consumer Electronics• Medical Sciences• Internet• Entertainment• Game System Hardware• Electronic Toys• Virtual Reality Hardware• Human Interface Devices• Military Career Opportunities • Project Engineer/Manager• Network System Administrator/Manager• Data Communications Engineer• Systems Engineer/Developer/Manager• Systems Analyst/Designer• Technical Support Engineer/Manager• Test Engineer• “Technopreneur”• Software Engineer• Quality Assurance Engineer• Educator and Researcher UE’s CPE Achievements Philippine Association of Colleges and Universities Commission on Accreditation (PACUCOA), Level IICandidate Status Bachelor of Science in Mechanical Engineering (BSME) Mechanical engineering deals with machine design, energy conversion, fuel and combustion technologies, heat transfer, materials, noise control and acoustics, manufacturing processes, rail transportation, automatic control, product safety and reliability, solar energy and technological impacts to society. Mechanical engineering is one of the broadest and oldest branches of engineering and can require work that ranges from the design and manufacture of very fine and sensitive instruments to the design and fabrication of mammoth power plants. It deals with all aspects of the conversion of thermal"
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 5,
    "content": "energy into useful work and the machines that make this possible. Mechanical engineering involves the creative design, manufacturing, testing, evaluation and distribution of such devices as automobiles, home appliances, spacecraft, rocket engines, air-conditioning equipment, nuclear and fossil fuel power plants, controls, robotics, and many types of instruments. In order to prepare for such a broad field, mechanical engineers must have a solid foundation in physics, chemistry and mathematics. This field also includes studies in basic mechanics of solids and fluids, electricity and electronics, controls, dynamic analysis, mechanical design, thermodynamics, and heat transfer. Program Educational Objectives Three to five years after graduation, the Mechanical Engineering alumni shall:1. have pursued advancement towards becoming globally competitive leaders in their chosen field of practice.2. be contributors to the development of a progressive society, guided by the UE core values of Excellence, Integrity, Professionalism, Teamwork, Commitment, Transparency, Accountability and Social Responsibility. Ability to apply knowledge of mathematics and science to solve engineering problems. Ability to design and conduct experiments, as well as to analyze and interpret data. Ability to design a system, component or process to meet desired needs within realistic constraints such as economic, environmental, social, political, ethical, health and safety, manufacturability, and sustainability, in accordance with standards. Ability to function in multidisciplinary teams. Ability to identify, formulate and solve engineering problems. Understanding of professional and ethical responsibilities. Ability to communicate effectively. Broad education necessary to understand the impact of engineering solutions in global, economic, environmental and societal contexts. Recognition of the need for and an ability to engage in lifelong learning. Knowledge of contemporary issues. Ability to use techniques, skills and modern engineering tools necessary for engineering practice. Knowledge and understanding of engineering and management principles as a member and leader in a team, to manage projects in multidisciplinary environments. The Mechanical Engineering Curriculum After completing the Fundamentals of Engineering course and learning the mathematics andscience (physics, chemistry) foundation courses necessary for the study of engineering science, studentsproceed with the materials science, solid and fluid mechanics, thermodynamics, heat transfer, machinedesign, and system dynamics. Elective courses in Mechanics and Material Sciences, Design andManufacturing, Mechatronics, and Energy Systems are pursued toward career goals. A team-basedsenior project completes the technical education. The Mechanical Engineering curriculum is constructed to include abundant experiential learning.This is accomplished through the integration of laboratory experiences within the framework of thetheoretical courses in the basic curriculum, and by making use of well-equipped"
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 6,
    "content": "laboratories andcomputing facilities. Concentrations in manufacturing engineering, control systems and automationengineering are available in this program, with a focus on robotics and automation, feedback andproduct and process design, and manufacturing systems. A multidisciplinary field, it integrates knowledge from the areas of science, mathematics, computers, mechanical engineering, electronicsengineering, and automation. Following courses in fundamental engineering knowledge, students learnhow to apply sound scientific principles to solve practical problems in industry in the area ofmanufacturing engineering. This concentration places an emphasis on the application of computersystems to modern manufacturing by means of topics such as robotics, computer-aided design (CAD),hydraulics and pneumatics systems (H&amp;P), programmable logic controllers (PLC), computer-aidedmanufacturing (CAM) and computer-integrated manufacturing (CIM). The Mechanical Engineering offers the following specialized track:Track 1: Energy Engineering and ManagementTrack 2: Mechanical Equipment for Buildings Program Outcomes: By the time of graduation, the students of the program shall have the ability to:a. Apply knowledge of mathematics and science to solve complex mechanical engineering problems;b. Design and conduct experiments, as well as to analyze and interpret data;c. Design a system, component, or process to meet desired needs within realistic constraints, in accordance with standards;d. Function in multidisciplinary and multi-cultural teams;e. Identify, formulate, and solve complex mechanical engineering problems;f. Understand professional and ethical responsibility;g. Communicate effectively;h. Understand the impact of mechanical engineering solutions in a global, economic, environmental, and societal context;i. Recognize the need for, and engage in life-long learning;j. Know contemporary issues;k. Use techniques, skills, and modern engineering tools necessary for mechanical engineering practice;l. Know and understand engineering and management principles as a member and leader of a team, and to manage projects in a multidisciplinary environment. Areas of Mechanical Engineering • Aeroelasticity• Air Pollution• Biomechanics• Biomedical Engineering• Combustion• Computer-aided Design• Dynamics• Turbomachinery• Vibrations• Rotocraft Dynamics• Materials Science• Materials Engineering Career Opportunities • Project Engineer• Power Plant Supervisor/Manager• Design Engineer for Manufacturing• Fabrication Supervisor/Manager• Automotive Engineer• Safety Engineer• Sales Engineer• Entrepreneur• Material Testing Engineer• Heating, Ventilation and Air-Conditioning (HVAC) Engineer• Instrumentation and Control Engineer• Educator and Researcher• Robotics and Mechatronics Engineer• Industrial Process Engineer• Project Management Consultant Mechanical engineers study the behaviour of solids, liquids and gases when forces are applied tothem and when they are heated and cooled. They learn how to convert energy efficiently from one formto another. Using this knowledge base, mechanical engineers play key roles in the design oftransportation systems, including automobiles and space vehicles; environmental control systems andprocesses, including robots; energy conversion technology,"
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 7,
    "content": "including engines and power plants;biomedical devices; and so on. The tremendous breadth of Mechanical Engineering gives the mechanicalengineer access to employment in every major industry.Mechanical engineers have traditionally been concerned with a great variety of technologies,such as energy conversion, machine design, instrumentation and control of physical processes, and control of the environment. Mechanical engineers fill essential roles in the entire spectrum of industrialenterprises, including even apparently “non-mechanical” ones such as the aerospace, chemical,computer and electrical power industries. Some new and exciting areas currently demanding mechanicalengineers’ expertise include the artificial organ (heart, lungs, kidneys) and prosthetic limb and jointdesign, high-performance composite materials development, flexible manufacturing, mechanical designautomation, and the control of industrial environmental pollution. UE’s M.E. Achievements Philippine Association of Colleges and Universities Commission on Accreditation (PACUCOA), Level IICandidate StatusUE’S ME licensure exam consistently attained a 100 percent passing percentage (March 2018 up toSeptember 2016, March 2015, March 2013) and also include topnotcher Engr. Allen Kristoffer A. Andres(7th, September 2012). Bachelor of Science in Information Technology (BSIT) The Bachelor of Science in Information Technology program emphasizes the acquisition of concepts and technologies, preparing and enabling the student for the industrial practice of systems integration, systems administration, systems planning, systems implementation, and other activities that maintain the integrity and proper functionality of a system and its components. It is expected that a student graduating under this degree program had undergraduate or industry preparation that would have exposed him/her to programming concepts and skills as well as the operating environment of a network system. PROGRAM OUTCOMES (from CMO) The program must enable students to attain, by the time of graduation: An ability to apply knowledge of computing, science, and mathematics appropriate to the discipline. Understand best practices and standards and their applications. An ability to analyze complex problems, and identify and define the computing requirements appropriate to its solution. Identify and analyze user needs and take them into account in the selection, and creation, evaluation, and administration of computer-based systems. An ability to design, implement, and evaluate computer-based systems, processes, components or programs to meet desired needs and requirements under various constraints. Integrate IT-based solutions into the user environment effectively. Apply knowledge through the use of current techniques, skills, tools, and practices necessary for the IT profession. Function effectively as a member or leader of a development team recognizing the different roles within a team to accomplish a common goal. Assist in the"
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 8,
    "content": "creation of an effective IT project plan. Communicate effectively with the computing community and with society at large about complex computing activities through logical writing, presentations, and clear instructions. Analyze the local and global impact of computing information technology on individuals, organizations, and society. Understand professional, ethical, legal, security, and social issues and responsibilities in the utilization of information technology. Recognize the need for an engagement in planning self-learning and improving performance as a foundation for continuing professional development. PROGRAM EDUCATIONAL OBJECTIVES (IT) Graduates of the program, within a few years after graduation, will be expected to Pursue a successful career as computing professionals, utilizing the knowledge acquired in the program; Maintain high professionalism and ethical standards as individuals or member of a team, in solving multidisciplinary projects related to Computer and Information Technology problems; Demonstrate effective oral and written communication skills; Demonstrate a good breadth of knowledge in the core areas of IT, so as to create products and solutions for real-life problems; and to make a positive impact on society, the global economy, and emerging technologies; Enhance their professional skills by means of continuous education and professional development; and Demonstrate professional and ethical responsibility towards their profession, society and the environment, as well as respect for diversity. Bachelor of Science in Computer Science (BSCS) The Bachelor of Science in Computer Science program emphasizes comprehension of the principles and concepts needed for designing and formulating new systems and applications. It encourages the inquisitive pursuit and investigation of new ideas and developments to prepare the student for a subsequent Master’s degree program. It is assured that students entering this degree program have higher level mathematical foundations for abstract algebra, mathematical logic, calculus, discrete mathematics, and statistics. The program must enable students to attain, by the time of graduation:A. Apply knowledge of computing fundamentals, knowledge of a computing specialization, and mathematics, science, and domain knowledge appropriate for the computing specialization to the abstraction and conceptualization of computing models from defined problems and requirements.B. Identify, analyze, formulate, research literature, and solve complex computing problems and requirements reaching substantiated conclusions using fundamental principles of mathematics, computing sciences, and relevant domain disciplinesC. An ability to apply mathematical foundations, algorithmic principles and computer science theory in the modeling and design of computer-based systems in a way that demonstrates comprehension of the tradeoffs involved in design choicesD. Knowledge and understanding of information security issues in relation"
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 9,
    "content": "to the design, development and use of information systemsE. Design and evaluate solutions for complex computing problems, and design and evaluate systems, components, or processes that meet specified needs with appropriate consideration for public health and safety, cultural, societal, and environmental considerations.F. Create, select, adapt and apply appropriate techniques, resources and modern computing tools to complex computing activities, with an understanding of the limitations to accomplish a common goalG. Function effectively as an individual and as a member or leader in diverse teams and in multidisciplinary settingsH. Communicate effectively with the computing community and with society at large about complex computing activities by being able to comprehend and write effective reports, design documentation, make effective presentations, and give and understand clear instructionsI. An ability to recognize the legal, social, ethical and professional issues involved in the utilization of computer technology and be guided by the adoption of appropriate professional, ethical and legal practicesJ. Recognize the need and have the ability to engage in independent learning for continual development as a computing professional. Bachelor of Science in Information System (BSIS) The Bachelor of Science in Information Systems program aims to prepare the student to become an IT professional and to have mastery on the design and implementation of Information Technology and Systems as applied solutions for business processes. PROGRAM OUTCOMES (from CMO) The program must enable students to attain, by the time of graduation: An ability to apply knowledge of business processes, computing, mathematics and social sciences appropriate to Information Systems. An ability to analyze a problem, identify and define the computing requirements with respect to organizational factors appropriate to its solution and plan strategies for their solution. An ability to evaluate information systems in terms of general quality attributes and possible trade-offs presented within the given requirement. An ability to design, implement, and evaluate information systems, processes, components, or programs and to source cost-benefit efficient alternatives to meet desired needs, goals and constraints. Use knowledge and understanding of enterprises in modeling and design of information systems. Deploy and use effective skills, tools and techniques necessary for information systems practice. Function effectively on teams (recognizing the different roles within a team and different ways to organizing teams) to accomplish a common goal. Communicate effectively with a range of audiences. Communication skills include technical writing, presentation and negotiation, and numeracy. Recognize the legal, social, ethical and professional issues involved in the exploitation"
  },
  {
    "filename": "College of Engineering Course Information.docx",
    "chunk": 10,
    "content": "of computer technology and be guided by the adoption of appropriate professional, ethical and legal practices both in the local and global community. Recognize the need for and engage in independent and life-long learning, planning self-learning and improving performance as the foundation for on-going professional development. PROGRAM EDUCATIONAL OBJECTIVES (IS) Graduates of the program, within a few years after graduation, will be expected to: Pursue a successful career as computing professionals, utilizing the knowledge acquired in the program; Maintain high professionalism and ethical standards as individuals or member of a team, in solving multidisciplinary projects related to Information Systems problems; Demonstrate effective oral and written communication skills to collaborate with persons in various information systems roles, including those in the role of user, manager, developer, analyst, and database/network administrator; Demonstrate good breadth of knowledge in planning, leading, organizing, and participating in teams and team-based projects, that guides organizations to successful and sustainable information-system-based solutions; Enhance their professional skills by means of continuous education and professional development; and Demonstrate professional and ethical responsibility towards their profession, society, and the environment, as well as respect for diversity. Bachelor of Science in Entertainment and Multimedia Computing (BSEMC) With specialization in Digital AnimationThe Bachelor of Science in Entertainment and Multimedia Computing (BSEMC) program, with specialization in Digital Animation, aims to prepare students to be digital animation professionals, who are equipped with creative and technical knowledge, skills and values in conceptualizing, designing, and producing animation products and solutions, and in managing such projects over different technology platforms. Bachelor of Science in Entertainment and Multimedia Computing (BSEMCG) With specialization in Game DevelopmentThe Bachelor of Science in Entertainment and Multimedia Computing (BSEMCG) program, with specialization n Game development professionals, who are equipped with creative and technical knowledge, skills and values in conceptualizing, designing, and producing digital games and tools, and in managing such projects over different technology platforms. Bachelor of Science in Data Science (BSDS) The BSDS program includes the study of data and the methodologies, processes, algorithms, and systems for collecting, refining, storing, and analyzing data to arrive at useful insights and knowledge. Data Science is a discipline in computing that benefits from developments in computer science, mathematics, statistics, business, and other disciplines."
  },
  {
    "filename": "college school calendar.docx",
    "chunk": 0,
    "content": "Colleges School Calendar First and Second Semester 2024- 2025Caloocan Campuse Graduate School, Arts And Sciences, Business Administration, Computer Studies and Systems, Engineering and Fine Arts, Architecture & Design I. SCHEDULE OF ADMISSION AND REGISTRATION ADMISSION & REGISTRATION SCHEDULE First Sem. 2024-2025 Second Sem. 2024-2025 -ADMISSION – College Freshmen (1st Year, 1st Semester) June 18 – August 01, 2024 January 03 – 15, 2025 New Students: GS, CLAW, & Graduate Dentistry June 18 – August 01, 2024 January 03 – 15, 2025 Transferees & Degree Holders July 01 – August 01, 2024 January 08 – 15, 2025 Cross-Registrants July 22 – August 01, 2024 January 10 – 15, 2025 – REGISTRATION – College Freshmen (1st Year, 1st Semester) June 18 – August 01, 2024 January 03 – 15, 2025 New Students: GS, CLAW, & Graduate Dentistry June 18 – August 01, 2024 January 03 – 15, 2025 All Curricular Years July 15 – August 01, 2024 January 03 – 15, 2025 Transferees & Degree Holders July 20 – August 01, 2024 January 08 – 15, 2025 Cross-Registrants July 22 – August 01, 2024 January 10 – 15, 2025 Last Day of Regular Registration August 01 (Th), 2024 January 15(W), 2025 II. SCHEDULE OF CLASSES SCHOOL CALENDAR First Sem. 2024-2025 Second Sem. 2024- 2025 FIRST DAY OF REGULAR CLASSES August 01 (Th), 2024 January 15 (M), 2025 PRELIMINARY EXAMINATIONS CAS, CBA, CCSS, CDENT, CEDUC, CENG’G, CFAD – – MW Classes September 16(M) & 18(W) February 19(W) & 24(M) TTh Classes September 05 (Th) & 10(T) February 20(Th) & 27 (Th) F Classes September 06(F) February 21(F) S Classes September 07(S) February 22(S) MIDTERM EXAMINATIONS Graduate School, CLAW & Graduate Dentistry – – MW Classes October 07(M) & 09(W) March 12(W) & 17(M) TTh Classes September 26(Th) & October 01(T) March 18(T) & 20(Th) F Classes September 27(F) March 14 (F) S Classes September 28(S) March 15 (S) CAS, CBA, CCSS, CDENT, CEDUC, CENG’G, CFAD – – MW Classes October 28(M) & 30(W) April 02(W) & 07(M) TTh Classes October 17(Th) & 22(T) April 08(T) & 10(Th) F Classes October 18(F) April 04 (F) S Classes October 19(S) April 05 (S) HOLIDAY BREAKS Observance of All Saints’ Day Nov. 01 (F), 2024 Observance of All Souls’ Day Nov. 02 (S), 2024 Observance of Holy Week April 16 – 20, 2025 LAST RECITATION DAY MW Classes December 05 (Th) May 21 (W) TTh Classes"
  },
  {
    "filename": "college school calendar.docx",
    "chunk": 1,
    "content": "December 03 (T) May 23 (F) F Classes November 29 (F) May 16 (F) S Classes December 07 (S) May 17 (S) FINAL EXAMINATIONS MWF Classes December 09(M) & 11(W) May 26(M) & 28(W) TTh Classes December 10(T) & 12(Th) May 27(T) & 29(Th) F Classes December 13(F) May 30 (F) S Classes December 14(S) May 24 (S) Departmental Examinations December 06(F) May 25(Su) LAST DAY OF POSTING OF STUDENTS’ FINAL GRADES December 20(F) June 06 (F) SUMMER 2024 Caloocan Campus Graduate School, Arts And Sciences, Business Administration, Computer Studies and Systems, Engineering and Fine Arts, Architecture and Design I. SCHEDULE OF ADMISSION Transferees & Degree Holders June 04 (T) – June 13 (Th) Cross-Registrants June 06 (Th) – June 13 (Th) II. SCHEDULE OF REGISTRATION All Curricular Years June 04 (T) – June 13 (Th) Transferees & Degree Holder June 04 (T) – June 13 (Th) Cross-Registrants June 06 (Th) – June 13 (Th) Last Day of Regular Registration June 13 (Th) III. SCHEDULE OF CLASSES A. FIRST DAY OF CLASSES June 13 (Th) B. MID-TERM EXAMINATIONS July 01 (M) C. LAST RECITATION DAY July 18 (Th) D. FINAL EXAMINATIONS July 19 (F) E. DEADLINE FOR POSTING OF STUDENTS’ FINAL GRADES July 26 (F) IV. SCHEDULE OF CLASS HOURS (for classes of 2 hours per session) MORNING 7:30 – 9:30 ; 09:30 – 11:30 AFTERNOON 12:00 – 2:00 ; 02:00 – 04:00; 04:00 – 06:00 EVENING 6:00 – 8:00"
  },
  {
    "filename": "DEPARTMENT AND FACULTY.docx",
    "chunk": 0,
    "content": "Fine Arts (CFAD) Faculty Assistant Professor and Department Chair Ruby G. Sapaula Associate Dean and Faculty Ronwell Jason Bacani, MGT Assistant Professors Ellen D. Villanueva, MGT Richard S. Legaspi, AFA (also Curator) Rachell Ann M. Valbuena, MGT Semester-to-Semester Faculty and Dean Don S. Amorsolo, CSc Mentors and Faculty Jeffrey E. Baligad Angelu Jane S. Lagazo Elvin Jay E. Macanlalay Camille R. Teves Kristoffer M. Tolentino Multimedia Arts Faculty Associate Dean and Program Coordinator (OIC) Ronwell Jason Bacani, MGT Assistant Professors Ruby G. Sapaula, MGT Ellen D. Villanueva, MGT Richard S. Legaspi, AFA (also Curator) Rachell Ann M. Valbuena, MGT Semester-to-Semester Mentors and Faculty Isaac P. Castillo Kamil Jade A. Corpuz, MIT Heidi O. Dela Cruz Sharmaine E. Dela Cruz Robert G. Dela Cruz Randy S. Garcia RV Cyrille D. Berto Architecture Faculty Regular Faculty Archt. and Department Chair Art G. Barroca, M Arch College Secretary and Faculty Jan Michael H. De Olazo, M Arch Archt. and Faculty Melanie C. Gime, MSCM Semester-to-Semester Faculty Archt. and Faculty Randy O. Arcillas Marc Alan Angelo T. Arrogante Joselito Loreto L. Bersamina Jr. Alejandro E. Blandura Renee C. Borromeo, MBA Mervin E. Butchayo Lester Anthony G. Callunsod Jemnerey B. Co, MM Jhonel C. Condat Versalene C. Constantino Angelo G. Cortez Murielle G. Cristobal Andrew Luis S. De Leon Arnold T. De Vera Kennette Ann S. Datiblan Lara May R. Gabriel John Ernest F. Jose, M Arch John Vincent P. Lagman John Lemuel G. Llacuna Mirzi Edgin M. Manapol Melanio L. Martinez Jr. Charles Kevin A. Menor Major PJ Cian C. Pascua Nilo E. Rubio John Amerigus M. Swing Robert M. Tangtang Patrick E. Tappa Froilan N. Zamora Engr. and Faculty Joseph Jeano T. Bartolome Christian John J. Sanchez Ma Irish Marnel D. Villalobos, MSE Interior Design Faculty Regular Faculty IDr. and Program Coordinator Brigid A. Sarmiento, MAIE IDr. and Faculty Cynthia G. Leyson, MAIE Semester-to-Semester Faculty IDr. and Faculty Angelo Christian G. Aguilar Esmeralda W. Ayag, MPA Pamela Leila L. Santos Archt. and Faculty William T. Cayanan Jr. College of Engineering Faculty and Staff Administrative Team Dean: Dr. Angelita D. Guia Associate Dean: Dr. Paraluman G. Sim College Secretary: Engr. Edelito A. Handig Academic Records Clerk III: Eliza D. Flores Evaluator: Jennifer C. Tepase Laboratory Assistant: Mark Gil R. Flores Toolkeepers Electrical Engineering (EE): Gerell R. Barrozo Mechanical Engineering (ME): Marcelo L. Derilo, Jr. Civil Engineering (CE): Arman Levy B. Elcano Electronics and Communications"
  },
  {
    "filename": "DEPARTMENT AND FACULTY.docx",
    "chunk": 1,
    "content": "Engineering (ECE): Irene M. Lambot Information Technology (IT) Department Department Chair: Dr. Froilan E. De Guzman Faculty: Prof. Jan Erickson A. Ardeña Prof. John Ryan E. Celis Prof. Cynthia P. Deauna Prof. Erwindalgeriko F. Lagda Prof. Ryan Paul A. Obligar Prof. Mar Eli C. Sagsagat Prof. Jherold John R. Valdoz Computer Science (CS) Faculty Department Chair: Prof. Larry T. Rutaquio Jr. Faculty: Dr. Sheila A. Abaya Prof. Angelo P. Del Rosario Prof. Kathleen M. Dimaano Prof. Erlynjoy M. Framancilla Dr. Dennis B. Gonzales Prof. Amelia A. Pasilan Mechanical Engineering (ME) Faculty Department Chair: Engr. Ian Jimbo R. Constantino Faculty: Engr. Edwin S. Bautista Engr. Frederick G. Tadique Electronics and Communications Engineering (ECE) Faculty Department Chair: Engr. Mark Anthony C. Aseoche Faculty: Engr. Oliver G. Daitol Engr. Edelito A. Handig Engr. Lejan Daniel I. Perdio Engr. Amado T. Valencia, Jr. Computer Engineering (CpE) Faculty Department Chair: Dr. Nelson C. Rodelas Faculty: Prof. Arriane D. Cabreros Prof. Regie S. David Dr. Angelita D. Guia Dr. Joan P. Lazaro Dr. Alexis John M. Rubio Dr. Paraluman G. Sim Civil Engineering (CE) Faculty Department Chair: Engr. Mark Paolo D. Mission Faculty: Engr. Gabrielle D. Amparo Engr. Darrell John O. Bandino Engr. Ellanis Laine V. Blas Engr. Alexander D. Co Engr. Winston L. Go Engr. John Rei M. Gomez Engr. Mark Paolo D. Mission Engr. Reyman Solas Engr. Christine P. Torio College of Arts and Sciences Faculty and Staff Administrative Team Dean: Michelle H. Concepcion Associate Dean: Rhinalou C. Salamat College Secretary: Felipe R. Alcala, Jr. Principal: Marilou S. Alonzo Regular Faculty Department of Languages (DL) Marvin M. Abreu Rossanna V. Mendoza Darwin M. Gulanán Ma. Victoria Z. Godinez Department of Tourism and Hospitality Management (DTHM) Christi Blandina Aldave Richard S. Gamier Galilea R. Lajara Mary Ann N. Rosalejos Josephine R. Tabor Department of Philosophy (DP) Melvin S. Carreon Department of Mathematics and Natural Sciences (DMNS) Michael Glenn Y. De Guzman Edie Boy M. Dela Cruz Jo-Ann M. Masungsong James Paul P. Ignacio Aida V. Menor Maribel G. Miraflor Ana Liza D. Paet Maria Cecilia D. Salangsang Department of Communication (DC) Concepcion C. Demausa Mary Kathleen G. Javillonar Efren C. Gimoto Jr. Department of Social Sciences (DSS) Gerald A. Dizon Annabelle M. Espiritu Ronnie M. Gillego Maria Filipinas C. Loquellano Peter R. Go-Monilla Ramon Rafael M. Quiroz Monica F. Reyes Kristoffer Kiel M. Santos Office Staff Leah C. Corpuz Diary L. Bernabe Jessica R. Sajor"
  },
  {
    "filename": "DEPARTMENT AND FACULTY.docx",
    "chunk": 2,
    "content": "Paulino S. Abagon Jerson S. Rance, Jr. College of Business Administration Faculty and Staff Administrative Team Dean: Prof. Emeteria B. Dalisay Associate Dean: Prof. Abner A. Aquino College Secretary: Mildred Sharon L. Sotelo Department of Management and Entrepreneurship Faculty Department Chair: Prof. Ildefonso G. Mariquit Jr. Faculty: Prof. Rosalinda B. Lacerona Prof. Cleto L. Nambatac Prof. Eloida C. Dagumboy Prof. Virginia C. De Leon Prof. Shyla R. Atienza Department of Marketing, Business Communication, Behavioral Science, and Computer (MARBBEC) Faculty Department Chair: Prof. Jocelyn S. Brigino Faculty: Prof. Ma. Victoria L. Guevarra Dr. Ernesto B. Arpon Department of Finance, Economics, and Mathematics (FECOMATH) Faculty Department Chair: Prof. Jocelyn S. Brigino Faculty: Prof. Mildred Sharon L. Sotelo Prof. Abner A. Aquino Prof. Amelia A. Pasilan Prof. Aileen B. Marquez Prof. Yonardo A. Gabuyo Prof. Josefina N. Roque Prof. James Paul P. Ignacio Prof. Miguel Alphonso Emmanuel O. Talag Prof. Juniel Go Prof. Giancarlo P. Go Department of Accounting, Law, and Taxation (ACLAT) Faculty Department Chair: Prof. Ken Elexander C. Cabinian Faculty: Prof. Rochelle B. Mendez Prof. Emeteria B. Dalisay Prof. Jesse Ichiro P. Cinto Prof. Rob Miguel C. Manapsal Prof. Lea Christine S. Vergino Prof. Gloria S. Garcia Atty. Jonathan Mario D. Ibe Atty. Marjay Zenn B. Iguara Dr. Nomer Q. Marmolejo Prof. Mary Grace P. Dela Cruz Atty. Jonathan L. Seebok Atty. Michelle Inovejas-Sy Juco Dr. Jano C. Minorca Prof. Janssen Rae B. Ramos Atty. Morris James C. Masalihit Prof. Roan C. Benitez Dr. Jherome G. Ng Prof. Joselito B. Jordas Prof. Dexter L. Rizano Office Staff Clerk: Mr. Frederick K. Mallillin Junior Evaluator: Ms. Julita C. Mercado Academic Records Clerk: Ms. Novavilla M. Tagle Clerk Stenographer: Ms. Jenny Lyn M. Nario Clerk: Ms. Irene A. Barbon"
  },
  {
    "filename": "Department Heads.docx",
    "chunk": 0,
    "content": "Dr. Angelita D. Guia Dean, College of Engineering Prof. Ethel Cecille M. Baltazar Assistant University Registrar, Department of Registration and Records Management University of the East - Caloocan Mrs. Fely A Diego Assistant Director, Department of Libraries University of the East - Caloocan Mrs. Bernadette A. Viduya Assistant Director, Admissions Office University of the East - Caloocan Prof. Maria Carmina Gonzales Coordinator, Department of Physical Education University of the East - Caloocan Prof. Marilou S. Alonzo Principal, Basic Education Department - Caloocan University of the East - Caloocan Prof. Victoria E. Gaño Assistant Principal, Basic Education Department - Caloocan Dr. Rogelio I. Espiritu Director, Office of Extension And Community Outreach University of the East - Caloocan Mr. Antonio C. Postrado Jr. Guidance Coordinator, Guidance, Counselling and Career Services Office University of the East - Caloocan Prof. Annabelle M. Espiritu Coordinator, On-the-Job Training University of the East - Caloocan Prof. Amelia A. Pasilan Coordinator, Accreditation University of the East - Caloocan Mr. Clemente A. Diwas Student Affairs Office University of the East - Caloocan"
  },
  {
    "filename": "DRRM 1&2 record.docx",
    "chunk": 0,
    "content": "Department Of Registration Records Management email: drrm.cal@ue.edu.ph Class Registration To register for courses at the university, students are required to utilize the UE Online registration system. You can access it by logging in to https://www.ue.edu.ph/iEnroll/login.html Registration deadline for the upcoming semester Visit the UE School Calendar. View this link: https://www.ue.edu.ph/mla/school-calendar-events-activities/ Request an official transcript of records You have the option to apply either onsite or online via email. For onsite applications, you can visit the NDDRM office to fill out the necessary form and obtain clearances from various offices such as SAO, Accounting, etc., and pay the required fee. Processing time typically takes a maximum of 15 working days, but it may take longer if done online. Process of dropping a subject To drop subjects, you can access your student portal and navigate to online transactions, then select the option for dropping subjects. Drop or add class after a semester started You have the option to drop a subject for the current semester up until the first day of midterm exams. This ensures that your withdrawal is officially recorded, and your transcript will reflect a \"W\" (withdrawn) mark for the dropped subject. Pre-requisite for certain courses and how to fulfill them To find out your prerequisites, it's recommended to request the curriculum template from your college, as it includes the necessary prerequisites. Request course substitution Proceed to your concern college. Application for graduation Ensure that you're identified as a graduating student. If not, proceed directly to your college and inquire why you haven't been marked as graduating. Transfer credits to another institution If you're considering transferring to UE, simply head straight to the admission office. They'll assist you in the process of crediting your subjects from other colleges. Special registration for students with disabilities When you visit the admission office for enrollment, you have the option to declare yourself as a PWD (Person With Disability). A list of PWDs with their respective disabilities is maintained, and memos are sent to various colleges to ensure appropriate accommodations are provided. Request a course withdrawal with academic penalty For freshmen, you have a window of 2 weeks to withdraw all your credentials. There won't be any academic penalty, but there will be a financial penalty due to deduction fees. Request certificate of enrollment You can apply online or onsite and apply for certificate of enrollment or certified true copy of records in university."
  },
  {
    "filename": "DRRM 1&2 record.docx",
    "chunk": 1,
    "content": "Policy on requesting transcript and sending it to multiple recipients individuals apply to the university for a copy of their transcript, especially when applying for master's degree programs abroad. The university then directly sends the records to the respective institutions. Here are the online transactions available in the student portal: iEnroll https://www.ue.edu.ph/iEnroll/login.html Dissolved Class https://www.ue.edu.ph/portals/sp/dissolvedclass Apply for Student I.D. https://www.ue.edu.ph/portals/sp/applyid Invalidation of Registration https://www.ue.edu.ph/portals/sp/invalidregs Cancellation of Registration https://www.ue.edu.ph/portals/sp/cancelregs Dropping of Subject https://www.ue.edu.ph/portals/sp/dropsubject Removal of LFR Mark https://www.ue.edu.ph/portals/sp/removaloflfr Online Payment https://www.ue.edu.ph/portals/sp/onlinepayment Dear Warrior Enrollees: Please be advised that your Tuition and Other Fees payable to the UNIVERSITY OF THE EAST should be paid only through our legitimate payment platforms as follows: Campus Tellers (i.e., Over the Counter) Philippine National Bank (Online/Mobile Banking or Over the Counter at any PNB branch) Bills Payment (via GCash, Paymaya/Maya and Bancnet-affiliated banks) Fund Transfer (Online/Mobile Banking via InstaPay) Credit/Debit Card via Global Pay (payment links for which may be sent to your email address from finance@ue.edu.ph or Global Payments Email Pay via emailpay@gpapecomm.com) The recipient account should be verified and named after the UNIVERSITY OF THE EAST or UNIVERSITY OF THE EAST CALOOCAN. THE UNIVERSITY OF THE EAST DOES NOT CALL OR TEXT ANY UE STUDENT OR ENROLLEE TO PAY FOR THEIR ACCOUNT BALANCES. SUCH COMMUNICATIONS ARE EXCHANGED THROUGH THE FOLLOWING: Student Accounts Section (Over the Counter) Official Email of the University Addressed to the Students Postal Mail For balance inquiries, you may call the UE Student Accounts Section via tel. no. 8735-5471 local 347. For payment inquiries, you may call the UE Finance Department via tel. no. 8735-5471 local 335, 337 or 437. Please be guided accordingly. Thank you. Apply for Refund https://www.ue.edu.ph/portals/sp/refund"
  },
  {
    "filename": "email directory.docx",
    "chunk": 0,
    "content": "What are the email directories of UE Caloocan?: Admissions Office inquiries on college-freshmen and Grade 11 admission, registration, enrollment, and entrance test matters admissions.caloocan@ ue.edu.ph IT Department concerns, such as Student Portal, Canvas and email access itd.cal@ ue.edu.ph College of Arts and Sciences-Caloocan (CAS Caloocan) programs, requirements, etc. cas.cal@ ue.edu.ph College of Business Administration-Caloocan (CBA Caloocan) programs, requirements, etc. cba.cal@ ue.edu.ph College of Engineering-Caloocan (CEng’g Caloocan) programs, requirements, etc. ceng.cal@ ue.edu.ph College of Fine Arts, Architecture and Design (CFAD) programs, requirements, etc. cfad.cal@ ue.edu.ph Basic Education Department-Caloocan—Kinder to Grade 12 requirements, etc. basiced.cal@ ue.edu.ph Department of Registration and Records Management (DRRM, a.k.a. the Registrar’s Office) concerns, such as applications for alumni/graduate documents (e.g., transcript of records, diploma, etc.) and education verification drrm.cal@ ue.edu.ph Department of Physical Education (PE Caloocan) concerns pe.cal@ ue.edu.ph Student Affairs Office (SAO Caloocan) concerns sao.cal@ ue.edu.ph Office of Extension and Community Outreach (OECO) and National Service Training Program (NSTP) concerns uenstp.caloocan@ ue.edu.ph Guidance, Counseling and Career Services Office (GCCSO Caloocan) matters gco.cal@ue.edu.ph Department of Libraries concerns library.cal@ue.edu.ph Student Accounts concerns (such as balance inquiries and other account matters) studentaccounts.cal@ue.edu.ph"
  },
  {
    "filename": "FREE ONLINE DATABASES.docx",
    "chunk": 0,
    "content": "FREE ONLINE SOURCE FOR RESEARCH/JOURNALS/LOCAL AND FOREIGN LITERATURE NAME LINK LOCAL 1. UE Research Bulletin Online //www.ejournals.ph/index.php?journal=UERB 2. Philippine Journals Online //www.philjol.info/index.php/index/index 3. U.P. Diliman Journals Online //journals.upd.edu.ph/ 4. Philippine E-Journals (hosted by C & E) //www.ejournals.ph/index.php?journal=index&page=index 5. DLSU-Manila Library Free and On-trial Electronic Databases //www.dlsu.edu.ph/library/free_databases/asp 6. Central Luzon State University //clsu.edu.ph/downloads/upload/134JTB%20VOL%2006.pdf 7. PICPA – Accounting Times //www.picpa.com.ph/PICPA/media/UploadedFiles/4b/4b3cc5ee-b507-4f22-9a74-20d93d5e46bc.pdf 8. Jose Rizal //www.joserizal.ph 9. Journal of Management for Global Sustainability //journals.ateneo.edu/ojs/jmgs FOREIGN 1. UE Research Bulletin Online //www.ejournals.ph/index.php?journal=UERB 2. Philippine Journals Online //www.philjol.info/index.php/index/index 1. Peer-Reviewed Open Access Journals //ucblibraries.colorado.edu/dean/peer_reviewed.htm 2. National Network of Libraries of Medicine //nnlm.gov 3. Directory of Open Access Journals //www.doaj.org/doaj?func=findJournals 4. E-Journals //www.e-journals.org 5. Virginia Tech (Journals Currently Hosted by Digital Library & Archives) //scholar.lib.vt.edu/ejournals/ 6. Nippon Foundation //www.nippon-foundation.or.jp/eng/current/20101126Ise.html 7. eHealth Intelligence Report //www.who.int/goe/ehir/featured2010/en/index.html 8. HEDBIB: International Bibliographic Database on Higher Education //hedbib.iau-aiu.net/ Login: INS0569 Password: bkbsi9ak 9. JOURNAL OF LIBRARY INNOVATION //www.libraryinnovation.org/ 10. The International Association of Universities (IAU) – E-bulletin //www.iau-aiu.net/ 11. www.khanacademy.org (lectures, video, exercises in many fields) //www.khanacademy.org 12. National Academic Press downloadble PDFs //notes.nap.edu/2011/06/02/more-than-4000-national-academies-press-pdfs-now-available-to-download-for-free/ 13. Early Education & Development //www.tandfonline.com/toc/heed20/current 14.Journal of Small Business & Entrepreneurship //www.tandfonline.com/toc/rsbe20/14/1 15.International Journal of Gaming and Computer-Mediated Simulations (2017, volume 9) //www.igi-global.com/gateway 16.International International Journal of Virtual Communities and Social Networking (2016, volume 8) //www.igi-global.com/gateway"
  },
  {
    "filename": "Functions of the Office of Curriculum Development and Instruction.docx",
    "chunk": 0,
    "content": "Functions of the Office of Curriculum Development and Instruction On Curriculum Development 1. Assists Colleges in the systematic planning, design, implementation, and evaluation of their curricula; 2. Ensures that curricula of Colleges comply with laws, memoranda, and standards set by the University, the Commission on Higher Education (CHED), and/or the Department of Education (DepEd); 3. Facilitates curriculum changes in response to the societal needs and to current trends in different professions; 4. Develops a standardized syllabus design for all courses in the University and keeps an updated file of all course syllabi; 5. Evaluates curricular designs for the Colleges based on current policies and procedures mandated by CHED or accreditors; 6. Serves as the permanent secretariat and implementing arm of the University Curricular Review Committee (UCRC). On Faculty Development 1. Assists the Colleges in their faculty development programs that respond to the needs of the faculty, using as basis the feedback from peer and students as well as the current trends in the profession and in education; 2. Organizes University faculty development activities and assists the Colleges in the conduct and evaluation of the same; 3. Assists the Colleges in obtaining, developing, and disseminating the latest resource and instructional materials to support faculty members in systematically meeting teaching standards; 4. Organizes the orientation of new faculty members on University policies, learning management systems (LMS), including grading systems, or as may be directed by the Office of the President; 5. Assists in the selection of faculty members to be granted scholarships, fellowships, travel grants, and financial assistance for faculty development towards approval of the CAO and SVP; 6. Assists in the review and revision of the Student Evaluation of Faculty Performance (SEFP) and similar instruments and to keep a file of the Academic Circulars on them; 7. Collects instructional materials that might be recommended for certain courses; 8. Participates in the preparation and organization of the Annual Faculty Conference; 9. Assists the Office of Research Coordination in critiquing research proposals for paper presentations and publication. On Instructional Technologies 1. Oversees implementation of IT programs where OCDI is involved; 2. Supervises development of course materials necessary for the adoption and use of the learning management systems (LMS); 3. Coordinates with the IT Department in the implementation of the learning management systems as well as the online operations of the SEFP; 4. Coordinates with the service provider of the LMS from roll out"
  },
  {
    "filename": "Functions of the Office of Curriculum Development and Instruction.docx",
    "chunk": 1,
    "content": "to implementation concerns; 5. Communicates with Deans, Principals, Program Heads, and faculty members for maximum use of the LMS; 6. Oversees the adoption of relevant educational technologies to improve the engagement of teachers and students. On Textbook Evaluation Assists the Basic Education and the different Colleges offering undergraduate courses in selecting and evaluating textbooks, laboratory manuals and other instructional materials that supplement instruction, in consonance with the DepEd’s and CHED’s objectives."
  },
  {
    "filename": "k10 school calendar.docx",
    "chunk": 0,
    "content": "Basic Education Department – Kindergarten to 10 (K10) School Year 2024-2025 Caloocan Campuse A. ADMISSION & ENROLLMENT SCHEDULE SCHOOL YEAR 2024-2025 ADMISSION Pre-school, Grade 1, & Grade 7 June 18 – August 01, 2024 Transferees June 18 – August 01, 2024 ENROLLMENT Pre-school, Grade 1, & Grade 7 July 01 – August 01, 2024 Other Curricular Years (Old Students) July 01 – August 01, 2024 Transferees July 01 – August 01, 2024 LAST DAY OF LATE ENROLLMENT August 01 (Th), 2024 B. SCHOOL CALENDAR SCHOOL YEAR 2024-2025 First Day of School Year August 01 (Th), 2024 First & Second Quarter Examinations First Quarter Examinations Deadline, posting of First Quarter Grades Second Quarter Examinations Deadline, posting of Second Quarter Grades September 30 – October 02, 2024 October 16 (W), 2024 December 02 – 04, 2024 December 18 (W), 2024 Holiday Breaks Observance of All Saints’ Day Observance of All Souls’ Day Christmas Season Observance of Holy Week November 01 (F), 2024 November 02 (S), 2024 Dec 19, 2024 until Jan 05, 2025 April 16 – 20, 2025 Third & Fourth Quarter Examinations Third Quarter Examinations Deadline, posting of Third Quarter Grades Fourth Quarter Examinations Remediation Classes/Defense/Immersion Deadline, posting of Fourth Remediation/Quarter Grades February 17 – 19, 2025 March 06 (Th), 2025 May 05 – 07, 2025 May 08 – 15, 2025 May 19 (M), 2025 C. OTHERS SCHOOL YEAR 2024-2025 Faculty Inset Last Week of July 2024 & First Week of January 2025 Parent-Teachers Conference (PTC) 1 week after the posting of quarterly grades Recognition / Moving Up Ceremonies CALOOCAN CAMPUS MANILA CAMPUS Grades 1-5 / Grades 7-9 1st week of June 1st week of June Kindergarten Grade 6 (Graduation) and Grade 10 (Moving up) 2nd week of June 2nd week of June Thanksgiving Ceremonies (Ecumenical) Grade 6 2nd week of June 2nd week of June Grade 10 2nd week of June 2nd week of June Summer 2024 Caloocan Campuse A. SCHEDULE OF ADMISSION & ENROLLMENT ADMISSION Cross Registrants June 04 (T) – June 13 (Th) ENROLLMENT Cross Registrants June 04 (T) – June 13 (Th) Old Students June 04 (T) – June 13 (Th) B. SCHOOL CALENDAR 1. First Day of Regular Classes June 13 (Th) 2. Last Recitation Day July 18 (Th) 3. Final Examination Day July 18 (Th) 4. Deadline for Posting of Final Grade July 19 (F) 5. Distribution of Certificate of RCM July 26 (F)"
  },
  {
    "filename": "Library record.docx",
    "chunk": 0,
    "content": "Find books on a specific topic You need to access our web OPAC. You can see it in canvas, portal, or library website. To access our web OPAC, you can find it on Canvas, the portal, or the library website. Access e-books online from home You can visit the UE Web OPAC (Online Public Access Catalog). Visit this link: https://library.ue.edu.ph/ OPAC Schedule Schedule: Mondays to Fridays, 9:00 a.m.-12:00 noon and 1:00-4:00 p.m. Renew library books Before the pandemic, you could renew library books by simply messaging the library, and there was an automatic response. However, due to face-to-face restrictions, renewals now require a physical visit to the library. Borrow or reserve Textbook You can borrow or reserve a book just go to this link. https://library.ue.edu.ph/ Reserving a study room in library Previously in TYK Library , there was a study room, but now it has been converted into a conference room. You can reserve a discussion room in the Engineering building one hour before your intended use. Book Borrowing restriction There is no restriction. Services available for PWD in Library Library treats PWD just like a regular student. But there is document delivery service. Through your UE email account. The library treats PWD just like any other student. Additionally, there is a document delivery service available through your UE email account. Access archives You go to manila campus and bring your ID, but make sure it is in the archives in OPAC. Borrowed Book Extension Yes, But you need to fillup a form again. If you failed to return it on time, there is a penalty fee. Can I donate books? Yes, you can as long as it is clean and neat to read. What are the guidelines for using library computers? You can use it as long as you want but if there is a lot of students who needs to use it. You can use it for 1 hour. How do I locate journals and magazines? Library is not subscribing anymore to journals and magazines but there is an updated one which is e-journals. Digital copies are free. The library no longer subscribes to print journals and magazines, but there is an updated collection of e-journals available. These digital copies are accessible for free. Are there quiet study area? There is no total quiet study area but the libraries are minimally quiet. Since, library nowadays are modernized and"
  },
  {
    "filename": "Library record.docx",
    "chunk": 1,
    "content": "dynamic. Can I access wifi? Yes, you can access wifi but there is a limit number of connections. How do I locate a specific library sections? Ask for the librarian and identify the area. Can I request that is currently check up? There is always 2 books available for each books so if one gets the other for overnight then you can choose the other one. But you can also choose digitalized book. There are always two physical copies of each book available, so if one is borrowed overnight, you can opt for the other copy. Additionally, you have the option to choose the digitalized version of the book. Are there resources for learning new language? Yes, there is because tourism usually use those. Citation guides available Librarian teaches how to use APA style and how to cite properly and how to bibliography and how to access electronic books. Research material for project Ask the librarian for the specific materials you need for your research project. There are 3 libraries in the University of the East, namely Engineering Library (located at 3rd floor of Engineering Building or EN Building, beside the Multi Purpose Hall 2 or MPH 2 and Multi Purpose Hall 3 or MPH 3), Lucio C. Tan Library (located at 5th floor of Lucio C. Tan Building or LCT Building, infront of Multi Purpose Hall 3 or MPH 3), Benjamin Chua Jr. Library (located at 6th floor of the Tan Yan Kee Building or TYK Building, above Chua King Ha Art Gallery). If you are in Engineering Building or EN Building, the nearest library is the Engineering Library. But you may also go to Benjamin Chua Jr. Library (TYK Library) through the foot bridge or connector connecting the Engineering Building (EN) and Tan Yan Kee (TYK) Building. If you are in Tan Yan Kee (TYK) Building, the nearest library is the Benjamin Chua Jr. Library or TYK Library. But you may also go to the Engineering Library (EN Library) through the foot bridge or connector connecting the Engineering Building (EN) and Tan Yan Kee (TYK) Building. If you are in Lucio C. Tan (LCT) Building, the nearest library is the Lucio C. Tan Library or LCT Library. Each building has each own library: EN Library, LCT Library, TYK Library. The assistant director for caloocan campus or of these three libraries is Mrs. Fely A. Diego, located in the"
  },
  {
    "filename": "Library record.docx",
    "chunk": 2,
    "content": "main library (Benjamin Chua Jr. Library or TYK Library). Here is her trunkline: 8367-45-72 loc 604 open Mon – Fri 8:00A.M. – 6:00P.M. For more info, visit their FB page: https://www.facebook.com/uelibrary Department of Libraries: In both entrances of the campus (either the one between STI Gate and Maria Cristina Building, or the one beside the Gymnasium), the nearest library to those two are in TYK Library. the official library website is at https://library.ue.edu.ph/ If you have further concerns regarding the library, you may contact or send your questions/queries to the library email address: library@ue.edu.ph You can use your free time in the library if you wish to. In Tan Yan Kee (TYK) Library, there is a room if you want to watch movies, documentaries, autobiographies and more. The CDs/DVDs are also available in the library but the availabality may vary. There is also free wifi in each libraries in the campus. There are couple of board games and other indoor games are also available in all 3 libraries. There are also drafting tables available and are found at the drafting section of the library. If you wish to visit the faculty of of DCSS, you can go to the second floor of Engineering Building. If you wish to visit the rest of the faculty of engineering, you can find it in the first floor of Engineering building. If you wish to visit the College of Engineering office. You can find it in the first floor of Engineering building. The stock room of Physics is located in the 2nd floor of Engineering building. The office of basic education department is located in the first floor of Basic Education Department at the front of cafeteria. Rules and Regulations 1. Current ID Card - Used to borrow library resources in all branches/sections of the library; non-transferable. 2.Referral letter - An endorsement letter signed by the University or Chief Librarian of other libraries to allow the interlibrary user to access the UE library collection and facilities; or an endorsement letter signed by the Director of UE Libraries to allow the UE academic community to supplement their research activities via other libraries. Borrowing of Library Collections 3.1. Circulation Books (Home Reading) Student/Faculty/Admin/Employee - Five books per week Renewable for another week unless needed by another researcher. Probationary Faculty - Two books per week Renewable for another week unless needed by another researcher. 3.2. Reserve Books"
  },
  {
    "filename": "Library record.docx",
    "chunk": 3,
    "content": "Student/Faculty/Admin/Employee - One book for overnight use Can be borrowed from 2 p.m. and must be returned at 9 a.m. of the following school day. 3.3. Reference/Filipiniana/Periodicals - For room use only but can be borrowed for a maximum of 30 mins. for photocopying. 3.4. Non-Print materials - For room use only but can be borrowed by faculty members for classroom viewing and to be returned within the day. 3.5. Theses/Dissertation - For room use only. 3.6. Archival materials - For room use only. 3.7. FINES FOR OVERDUE LOANS: 3.7.1. Circulation Books - Php10.00 per day of delay including Saturdays, Sundays and holidays 3.7.2. Reserve Books - Php10.00 per hour or a fraction thereof for the first day (Computed up to closing) and Php10.00 for each succeeding day, including Saturdays, Sundays and holidays 4. Replacement of lost book - Any lost book should be replaced by the same or later edition of the same title of the original book and the corresponding fine must be paid. If replacement is not possible, a recent book with the same subject content may be substituted and the corresponding fine must be paid. 5. Two weeks before the final examinations, all books shall be for room use only. 6. Readers' services shall cease 15 minutes before the indicated closing time to enable the library staff to put their area in order for the next day's operation. 7. Library Clearance - This is secured by all faculty members every end of a semester/summer, by all regular employees who will be on leave for a month or a longer period, retiring or resigning, and by all students when they apply for their academic documents. 8. In units where an open-shelf system is adopted, library users are required to deposit their personal things, except money and valuables, at the baggage/ control counters. 9. Writing on the books, walls, tables, chairs and other furniture and equipment inside and out of the library is prohibited. 10. Tearing off of pages or mutilation of books/periodicals is strictly prohibited. 11. Removal of library materials or property from the library premises is prohibited. 12. Reservation of seats is not allowed. Anything left on the tables for this purpose shall be removed to make room for other readers. 13. Eating, smoking, drinking, littering, loud talking and loitering inside the library are strictly prohibited. 14. All cell phones and other electronic gadgets are required"
  },
  {
    "filename": "Library record.docx",
    "chunk": 4,
    "content": "to be on silent mode while inside the library. If you fail to return the books on the deadline, you must pay a 10PHP penalty fee. The penalty fee will accumulate (including weekends) 10 PHP per day. However, if there are national holidays (such as New Year's Day, Maundy Thursday, Good Friday, Araw ng Kagitingan (Day of Valor), Labor Day, Independence Day, National Heroes Day, Bonifacio Day, Christmas Day, Rizal Day, Chinese New Year, EDSA People Power Revolution Anniversary, Black Saturday, Ninoy Aquino Day, All Saints' Day, All Souls' Day, Christmas Eve, New Year's Eve) and unforeseen circumstances such as typhoon, earthquake and whatnot, the penalty fee will not accumulate. Brief History of the UE Library 1947 The UE Library was organized in April 1947. It was located at the then Philippine College of Commerce and Business Administration (PCCBA) Building on R. Papa Street. The first books acquired were mostly on accounting, business and economics, which were purchased largely from American bookstores. 1948 The Library was transferred to the newly constructed Dalupan Hall, now Santiago F. de la Cruz Building at C.M. Recto Avenue. 1950 The Main Library was moved to the Dental Library Building, the present College of Computer Studies and Systems (CCSS) Bldg. where it occupied the entire third floor and the extension which was built in 1961. As new programs were introduced, branch libraries were also established. 1971 The Main Library was relocated to the Library-Engineering Building (formerly Library-Museum Bldg.), occupying the second and third floors. 1986 The Audiovisual Department came under the direction of the Department of Libraries. 1988 The Dental library was transferred from Santa Mesa Campus to the 3rd floor of the College of Dentistry Bldg., Gastambide, Manila Campus. 1994 The University Archives was established. 1996 The Main Library was converted into a modern and first class facility located on the 2nd , 3rd and 4th floors of the P.O. Domingo Center for Information Technology (POD CIT) Building (formerly Library-Engineering Bldg.). 2003 The Main Library in Caloocan campus, named into Benjamin G. Chua Jr. Library, was moved from 2nd floor Administration Building into the new Tan Yan Kee Bldg. 2006 The Elementary High School Department Library was established in June 2006 at Caloocan. 2011 Outstanding Academic and Research Library Awardee 2012 The Caloocan Elementary High School Department Library was transferred at the new Lucio C. Tan Building onSeptember 25 2013 An Information Commons Section"
  },
  {
    "filename": "Library record.docx",
    "chunk": 5,
    "content": "was created from the Multimedia Section at the 4th floor of the POD-CIT Bldg Welcome to the Benjamin G. Chua, Jr., Library located at the the TAN YAN KEE Building. The library was named after Mr. Benjamin G. Chua, Jr., one of the renowned and dedicated members of the UE Board of Trustees, who passed away in 2002. The library was inaugurated last December 11, 2003. It is open from 7am to 7pm, 12 hours a day, Monday to Friday. The different sections are the following; Circulation/Reserve, Periodicals, Filipiniana, and Reference/Fine Arts. There is also a multimedia room with 20 computers. The multimedia room has reference sources like Encarta, documentary movies like Tour to Malacanang, Mga Palasyo ni Erap, and Pope John Paul II visit to the Philippines. There are also movies like Joan of Arc, Lord of the Rings, Spiderman, Harry Potter, and many more. In addition to the Benjamin G. Chua Library, there are 2 more libraries in UE Caloocan namely, the Engineering Library located at the 3rd floor of the Engineering building and the Elementary/High School Library, which is housed at the 2nd floor of the Administration Building. Circulation and Reserved The Circulation Section houses the main library stacks. It includes the general reading room, the Reserve Section, the Computer Science Library, and the Office of the Assistant Director for Libraries. The Reserve Section makes available to students copies of approved textbooks and other books reserved by the faculty as basic readings for specific courses. The Computer Science Library allows students access to the growing collection of computer science materials, at the same time allowing them to charge out materials for home use. Seating capacity on this floor is 331. Reference, Library Science & Archive Reference services use print materials, multimedia and the Internet. Hence, in addition to an extensive research/reading room, there is also a multimedia room equipped with high-speed computers with Internet and multimedia capabilities. The collection of encyclopedias, dictionaries, handbooks, manuals, atlases, and other reference materials are either in printed or electronic format. Another special feature is a browsing area where clients can relax on comfortable seats with any of a large collection of well-selected and attractive books. Seating capacity is 234. Periodicals & Filipiniana The Circulation Section houses the main library stacks. It includes the general reading room, the Reserve Section, the Computer Science Library, and the Office of the Assistant Director for"
  },
  {
    "filename": "Library record.docx",
    "chunk": 6,
    "content": "Libraries. The Reserve Section makes available to students copies of approved textbooks and other books reserved by the faculty as basic readings for specific courses. The Computer Science Library allows students access to the growing collection of computer science materials, at the same time allowing them to charge out materials for home use. Seating capacity on this floor is 331. Branches/Sections of the Library UE Caloocan In every library, there is a multimedia section Benjamin G. Chua Jr. Library 6th fir., TYK Academic Bldg. Mondays-Fridays 8 a.m.- 6 p.m. Engineering Library 3rd flr., Engineering Building Mondays-Fridays 8 a.m.- 6 p.m. Multipurpose Halls 1 & 2 3rd fir., Engineering Bldg. Mondays-Fridays 8 a.m.-6 p.m. Multipurpose Hall 5 5th flr., Lucio C. Tan (LCT) Bldg. Lucio C. Tan Library (LCT) 5th flr., Lucio C. Tan (LCT) Bldg. Welcome to the UE Library The Department of Libraries acquires and catalogs books, non-books, CS-ROMs and audio visual materials, supplementing these with an extensive e-journals collection, to support UE’s instructional and research programs. The Department’s extensive catalog is for the use of students, faculty members and other members of the UE community. The Department, which is headed by its Director, is composed of the Main Library and the respective libraries of the different Colleges. Under the Department’s supervision is the Audiovisual Office. The Audio-visual Office makes available to the community equipment such as film, and overhead projectors: DVD, VCD, and other video players; tape recorders and sound systems; and the contents of the media library consisting of sound and video tapes, audio cassettes, graphs posters, transparencies, filmstrips, slides and others. MISSION STATEMENT AND OBJECTIVES The primary mission of the University Library is to support the teaching, research, learning, extension service, and cultural endeavors of the University community. It is committed to provide accessible, cost-effective, and innovative information services and programs. The general objective is to provide adequate, timely, and relevant information resources and innovative services that support the full spectrum of teaching, learning and research needs of the University community. Towards the fulfillment of such an objective, the Library accepts responsibility for the following: The selection, acquisition, development, organization, preservation, and dissemination of information resources in a variety of formats to support all academic and other concerns of the University; The provision of timely access to needed materials and information to meet the needs of the students, faculty and staff of the University; The provision"
  },
  {
    "filename": "Library record.docx",
    "chunk": 7,
    "content": "of instructional assistance and promotion in the use of library resources and services by providing a user-friendly and total care environment conducive to client needs; The provision and arrangement of physical facilities, equipment, and use of appropriate technology conducive to work, research, study, and learning; The establishment of appropriate linkages with other libraries and research institutions to enhance scholarly information resources and promote resource sharing; The development and encouragement of qualified and service-oriented Library staff crucial to the provision of high quality services. Here are the library resources available in the student portal: The UE Library Department provides students some useful resources : EBSCOhost is an intuitive online research platform used by thousands of institutions and millions of users worldwide. With quality databases and search features, EBSCOhost helps researchers of all kinds find the information they need fast. Why EBSCOhost for research? Basic and advanced search optionsEBSCOhost serves both new and experienced researchers with a variety of features to refine search results. Reliable, peer-reviewed contentEBSCOhost offers high-quality articles licensed from reputable publishers recognized by library professionals, chosen to meet the specific needs of researchers. Citation assistanceUsers can view, save, print, email or export citations in many formats directly from the database. Ability to save searches and resultsUsers can save searches and articles in a password-protected folder for later reference. Source: https://www.ebsco.com/products/ebscohost-platform How to access EBSCOhost? Simply click the link https://search.ebscohost.com// or the image below: NOTE: To access EBSCO outside the university campus, login using this: username: cal-student2023 password: *AY2023_CS What is Gale? Gale a Cengage company is an educational content, technology, and services company for the higher education, K-12, professional, and library markets worldwide. It has operations in more than 20 countries around the world. Gale is Cengage's library reference arm and specializes in e-research and educational publishing for libraries, schools and businesses. The company creates and maintains databases that are published online, in print, as e-books and in microform. Cengage offers print and digital textbooks, instructor supplements, online reference databases, distance learning courses, test preparation materials, corporate training courses, career assessment tools, materials for specific academic disciplines, and custom solutions. Source: https://en.wikipedia.org/wiki/Cengage How to access Gale? Simply click the link http://infotrac.galegroup.com/itweb/unieast or the image below. NOTE: To access GALE outside the university campus, login using this: password: research What is IG Library? IG Library is a new generation eBook platform developed by iG Publishing. Its simple and user friendly"
  },
  {
    "filename": "Library record.docx",
    "chunk": 8,
    "content": "interface helps you to retrieve information from huge eBook collections using a single click. It employs a powerful clustering engine to help you quickly analyze search results as well as to discover related topics. Our unique eBook reading technology allows users to read content via web browsers without installing any proprietary software. It not only provides a set of information tools for research purposes, it also supports various kinds of devices and operation systems including the iPad, iPhone, Android, Mac and Windows. Source: http://www.igpublish.com/ How to access IG Library? Simply click the link http://support.igpublish.com/info/ or the image below: NOTE: To access IGLibrary outside the university campus, login using this: username: ph_ue password: ph_ue@report What is e-library? ebrary (the \"e\" is lower case) is an online digital library of full texts of over 100,000 scholarly e-books. It is available at many academic libraries and provides a set of online database collections that combine scholarly books from over 435 academic, trade, and professional publishers. It also includes sheet music (9,000 titles) and government documents. Additionally, ebrary offers a service called \"DASH!\" for customers to distribute their own PDF content online. ebrary had 2,700 subscribers (mostly libraries) at the end of 2009. Users gain access through a subscribing library and can view, search, copy, and print documents from their computers. ebrary was founded in 1999, headquartered in Palo Alto, California, and was acquired by ProQuest in 2011. website: https://www.proquest.com/libraries/schools/ Source: https://en.wikipedia.org/wiki/Ebrary How to access Ebook Central (formerly) eBrary? Simply click the link http://site.ebrary.com/lib/ueph or the image below: NOTE: To access Ebook Central outside the university campus, login using this: username: uemanila2 password: uemanila02 What is the Wiley Library? Wiley Online Library is a subscription-based library of John Wiley & Sons that launched on August 7, 2010, replacing Wiley InterScience. It is a collection of online resources covering life, health, and physical sciences as well as social science and the humanities. website: http://site.ebrary.com/lib/ueph Source: https://en.wikipedia.org/wiki/Wiley_(publisher) Online and Offline Digital Learning System (ODLS) How to access Wiley Ebook Simply click the link https://onlinelibrary.wiley.com/ or the image below: NOTE: To access Wiley Ebook outside the university campus, login using this: username: UNIVERIEAST password: Wiley12345 What is Online Digital learning System-ODLS? ODLS is \"learning facilitated by technology that gives learners some element of control over time, place, path and/or pace. \" A unique technology in the world developed and owned by BRAINWORLD Group. Read & Learn Anytime,"
  },
  {
    "filename": "Library record.docx",
    "chunk": 9,
    "content": "Anywhere. Discover the best reads on various topics of interest in the Philippines languages, education and cultures. website: https://encleare.com/ How to access Encleare? Simply click the link https://encleare.com/ / or the image below: NOTE: To access Encleare outside the university campus, login using this: username: ue_caloocan password: U3E4C90"
  },
  {
    "filename": "Notable alumni of University of the East.docx",
    "chunk": 0,
    "content": "Notable Alumni of the University of the East (UE) Fernando Poe Jr. – National Artist of Film, actor, and politician Xian Lim – Actor, model, and basketball player James Yap – Professional basketball player (PBA) Noli De Castro – Broadcaster, former Vice President of the Philippines Christopher de Leon – Actor and former politician Virgilio S. Almario – National Artist for Literature, poet, and academician Robert Jaworski – Former PBA basketball player and coach Alfredo Lim – Former Mayor of Manila, politician Andrew Tan – Business tycoon, chairman of the Alliance Global Group Janina San Miguel – Former Miss Philippines World 2008 Paul Lee – Professional basketball player (PBA) Ronald Tubid – Professional basketball player (PBA) Edward Hagedorn – Former Mayor of Puerto Princesa Ferdinand Topacio – Lawyer and media personality Chen Hung-chang – Taiwanese politician and entrepreneur Paulyn Ubial – Former Secretary of Health of the Philippines Niño Canaleta – Professional basketball player (PBA) Roi Sumang – Professional basketball player (PBA) Ayong Maliksi – Politician, former Mayor of Cavite City Eliseo Rio, Jr. – Former Undersecretary of the Department of Information and Communications Technology (DICT) Paolo Hubalde – Professional basketball player (PBA) Roland Dantes – Former actor and martial artist Elmer Espiritu – Former professional basketball player (PBA) Bong Galanza – Professional basketball player (PBA) Carmen Lamagna – Politician, former mayor Lorna Silverio – Actress, politician Quinito Henson – Sports journalist and commentator Fernando Sena – Actor and businessman Arthur Angara – Politician and former Senator Romulo Galicano – Artist and academician Alberto Lim Jr. – Former Secretary of Tourism Josie Fitial – Politician, former First Lady of the Northern Mariana Islands Aurora Enerio-Cerilles – Politician, former Congresswoman Marella Salamat – Actress and model Felixberto Urbiztondo – Businessman and philanthropist Higino A. Acala, Sr. – Educator and community leader These individuals have made significant contributions in various fields, including politics, entertainment, business, and sports, showcasing the diverse talent and achievement of UE alumni."
  },
  {
    "filename": "Office for International Affairs and External Linkages.docx",
    "chunk": 0,
    "content": "OIL PROGRAMS Office for International Affairs and External Linkages The UE Office for International Affairs and External Linkages (OIL) directly reports to the President and Chief Academic Officer in coordination with the academic units. The office leads in preparing, designing, developing, and implementing policies, procedures, and programs for all internationalization projects, activities, and external linkages of the University. International Exchange Programs The University of the East enters into international exchange programs with international partner institutions. These programs provide opportunities for faculty members and students on the following academic engagements: Similarly, partner institutions can also send their faculty members and students to the said exchange program activities, in reference to what are stipulated in the MOUs/MOAs between UE and its host partner schools. International Partnerships and Linkages The University of the East establishes international ties with HEIs abroad to further strengthen its internationalization efforts in providing various international exchange programs and activities. The University agrees and signs MOUs/MOAs that eventually give international opportunities to both faculty members and students Partner International Institutions Soka University, Japan Maejo University, Thailand Universitas Katolik Widya Mandala Surabaya, Indonesia Darma Cendika Catholic University, Indonesia Kun Shan University, Taiwan Cheng Shiu University, Taiwan Mingshin University of Science and Technology, Taiwan Chinese Culture University, Taiwan Fooyin University, Taiwan Widyatama University, Indonesia(Note: To be updated.) International Students Services The UE OIL office offers guidance and support to the University’s international students (IS) to further facilitate ease and comfort in admission, registration, services, academics, and immigration/visa application, and processing related concerns. The OIL also provides assistance on UE IS’ social and academic life on campus, for them to be able to adapt to the Philippine culture and experience a fulfilling and rewarding academic journey in UE. International Activities and Programs The OIL also provides events, activities, and programs to IS and members of the UE community to further promote internationalization in the University. From organizing IS orientations and activities for international students, other programs include: Intensive English Workshop and Cultural Exchange Program (IEWCEP). The UE Colleges of Arts and Sciences-Manila and -Caloocan conduct English classes and Filipino cultural immersions to students of partner international HEIs (Chinese, Japanese, etc.) that provide more opportunities to speak English and learn the Filipino culture among student participants. The LAL (Learn a Language) Program. The Office also offers foreign language programs (e.g., Mandarin, Nihongo, French) to interested students, faculty members, or employees of the University."
  },
  {
    "filename": "Office for International Affairs and External Linkages.docx",
    "chunk": 1,
    "content": "FL teachers from partner HEIs are invited to conduct foreign language teaching to registered or invited participants. The “Lualhati” Forum. The OIL invites speakers from its partner HEIs to give talks or lectures on various multidisciplinary topics. This is done onsite or through a webinar. CONTACT DETAILS: UE Office for International Affairs and External Linkages (OIL)-Caloocan⚑ UE-Soka Room, TYK 212, 2nd Floor, Tan Yan Kee Academic Building, Caloocan Campus Prof. Annabelle M. EspirituCoordinator Dr. Darwin M. Guianan Director"
  },
  {
    "filename": "Offices.docx",
    "chunk": 0,
    "content": "University Relation Office (URO) The University Relation Office (URO) is primarily responsible for the following: Publications: URO handles the production of key publications such as: Panorama (official yearbook for UE graduates) Annual Report (to shareholders) Prospectus Student Handbook Brochures, handbooks, and flyers for various colleges and offices within the Caloocan Campus Special publications as required by University Management Public Relations: URO also manages: Institutional advertising Issuance of press releases and public information regarding UE and its services Office of Research Coordination (ORC) The Office of Research Coordination (ORC) plays a significant role in supporting and overseeing research activities at UE, with the following responsibilities: Research Coordination: Keeps up-to-date records on research studies from different colleges and faculty members, including completed, ongoing, and planned research. Clearing House: Serves as a clearing office for UE research studies, research reports, and related matters. Technical Assistance: Provides technical support for ongoing and planned research studies. Training: Organizes in-house Research Training Institutes for faculty and academic staff. Policy Studies: Undertakes institutional policy studies. Publications: Publishes the University Research Bulletin, featuring completed and ongoing research from colleges and faculty. Collaboration: Establishes collaborative relationships with research groups and institutions, including the UE Foundation for Research and Advanced Studies, Inc. (UE-FRASI). Office of Cultural Affairs (OCA) The Office of Cultural Affairs (OCA) is tasked with promoting and fostering cultural engagement within the UE community. Its main functions include: Cultural Ties: Establishes and nurtures cultural relationships within and outside the campus. Fosters exchange programs with foreign embassies. Aesthetic Development: Develops the aesthetic sensibilities of various sectors of the academic community. Student Engagement: Oversees the selection and recommendations for grants-in-aid and membership in cultural groups like the Dance Troupe, Chorale, Band, and Drama Company. Office for Quality Assurance (OQA) The Office for Quality Assurance (OQA) is responsible for maintaining and improving the quality of education at UE through the following functions: Accreditation and Certification: Monitors and oversees the achievement of accreditation and certification goals for the various colleges. Maintaining Certifications: Ensures the University maintains its current status and certifications such as Autonomous Status and Center for Development. Training Coordination: Coordinates quality assurance training needs for both teaching and non-teaching staff. Quality Assurance Mechanisms: Identifies and implements appropriate quality assurance mechanisms for the University. Each of these offices plays a key role in supporting the academic, cultural, research, and quality standards of the University of the East, ensuring the institution's growth"
  },
  {
    "filename": "Offices.docx",
    "chunk": 1,
    "content": "and development."
  },
  {
    "filename": "online enrollment.docx",
    "chunk": 0,
    "content": "Pre-admission Procedure at the University of the East Step-by-Step Guide for Applicants Online Application:Visit the Admissions Office or apply online for admission at www.ue.edu.ph/onlineadmission. Upload Required Documents:Upload a 2” x 2” photo with a white background and any of the following applicable documents: For College Applicants: Grade 12 graduates: Grade 12 report card Non-Formal Education graduates: PEPT/ALS rating Current Grade 12 students: Grade 11 report card College transferees: Transcript of records or Certification of grades Degree holders: Transcript of records Cross-enrollees: Permit to cross-enroll For Senior High School (SHS) Applicants: Grade 10 completers: Grade 10 report card Non-Formal Education graduates: PEPT/ALS rating Current Grade 10 students: Grade 9 report card Grade 12 transferees: Grade 11 report card Reference Number:Copy or take a screenshot of your reference number for future use. Pay Application Fee:Pay the application fee at the Finance Department. Submit Receipt and Check Status:Present the payment receipt at the Admissions Office to check the status of your application and the schedule for enrollment. Freshmen Procedure: Submit the original copy of admission requirements at the Admissions Office. Secure the Registration Form at the Admissions Office. Pay school fees at the Finance Department. Proceed to the Student Affairs Office (SAO) for processing your Identification Card (ID) and receive instructions regarding the school uniform. Transferees Procedure: Submit the original copy of the admission requirements at the Admissions Office. Proceed to the Dean’s Office for an interview and credential evaluation. Obtain endorsement from the College Dean for the Notice of Admission (NOA). Proceed to the College Dean’s Office for the Pre-Enrollment Form (PEF). Complete the PEF (refer to bulletin boards for subject schedule). Go to the Registration Area for advising and encoding of subjects. Secure the Registration Form at the IT Department. Pay school fees at the Finance Department. Proceed to the SAO for processing of ID and school uniform instructions. Degree Holders Procedure: Submit the original copy of admission requirements at the Admissions Office. Proceed to the Dean’s Office for interview and credential evaluation. Obtain the Notice of Admission (NOA) from the Admissions Office. Complete the Pre-Enrollment Form (PEF) from the College Dean’s Office. Follow the same steps as transferees for registration, payment, and ID processing. Cross-Registrants Procedure: Present the Cross Enrollment Permit from the registrar of the current school at the Admissions Office. Verify with the college offering the subjects to confirm availability. Obtain the Notice of Admission (NOA) from the"
  },
  {
    "filename": "online enrollment.docx",
    "chunk": 1,
    "content": "Admissions Office. Complete the Pre-Enrollment Form (PEF) and follow similar steps for registration, payment, and ID processing. Important Notes: CET Results: Results of the College Entrance Test (CET) are released immediately after the test. Freshmen Applicants: CETs for the upcoming school year start in August. By following these steps, you can ensure a smooth admission process at the University of the East."
  },
  {
    "filename": "SAO record.docx",
    "chunk": 0,
    "content": "How to File a Case for Sexual Harassment If you are a victim of sexual harassment, you should visit the Student Affairs Office (SAO) to formally file a case. The office will guide you through the process and ensure proper handling of the complaint. Joining Clubs or Organizations To join a club or organization at the University, you need to ask the head of the club or organization you wish to join. The SAO provides guidance on joining different student groups. List of Organizations The SAO publicizes the list of active student organizations. You can visit them and inquire about the available organizations you may want to join. Mental Health Support If you are in need of mental health support, visit the Guidance and Counseling Office for professional assistance and counseling services. Lost and Found If you lose any personal items on campus, head to the Student Affairs Office, which is located on the 1st floor of the Old Academic Building, for assistance in retrieving your lost items. The Student Affairs Office implements the University requirements, programs, policies, rules and regulations, insofar as students’ activities and welfare are concerned; supervises student organizations and their activities; coordinates student use of University facilities; coordinates student use of University facilities; conducts leadership training seminars and orientation programs for student leaders to make student activities more meaningful and productive; and handles complaints/problems of students. Cases against students are heard by the Board of Discipline which recommends the necessary sanctions to the President of the University. To get your ID, you may reach out to the SAO office. It plans and conducts in-service programs for student leaders and faculty advisers to create a better understanding and appreciation of student activities, especially in relation to their academic work. It likewise handles the issuance of ID cards to students, certification of no record of misconduct/misbehavior, and referrals of employment. THE UE INSTITUTIONAL OUTCOMES In pursuit of its vision and mission, the University will produce GRADUATES attuned to the constantly changing needs and challenges of the youth within the context of a proud nation, its enriched culture in the global community; able to produce new knowledge gleaned from innovative research-the hallmark of an institution’s integrity and dynamism; and capable of rendering relevant and committed service to the community, the nation and the world. MISSION To promote and sustain students’ total development and to enhance the quality of campus"
  },
  {
    "filename": "SAO record.docx",
    "chunk": 1,
    "content": "life, in collaboration with other academic units, and in line with the Total Student Care Program of the University. VISION To prepare students to be leaders in the 21st century by providing them with extracurricular opportunities and support services in their pursuit of a meaningful education at UE."
  },
  {
    "filename": "SCHOLARSHIP AND SPECIAL DISCOUNTS.docx",
    "chunk": 0,
    "content": "Eligibility for Special Discounts: Child of an OFW (Overseas Filipino Worker) Parent Child of a Lucio Tan Group of Companies (LTGC) Employee Child of a UE Alumnus Siblings Enrolled in UE Graduates of the UE High School or Basic Education Department These students are eligible for a discount on school fees per semester, provided they meet the following requirements: Academic Load: Must enroll with at least 18 units for the semester. Deadline: Submit the necessary documents on or before August 30 (for First Semester Enrollees) or January 30 (for Second Semester Enrollees). Required Documents: Photocopy of PSA Birth Certificate For OFW Child: Photocopy of the OFW parent’s passport Updated Overseas Employment Certificate (OEC) issued by POEA For LTGC Employee Child: Updated Parent’s Certification of Employment with the Lucio Tan Group For UE Alumnus Child: Photocopy of updated UE Alumni ID Card For UE High School Graduates: Freshman Discount: Graduates from the UE Basic Education Department are eligible for a discount upon their first enrollment at UE with at least 18 units. This discount is a great benefit for eligible students. Make sure to submit the required documents within the specified deadlines for the smooth processing of your discount!"
  },
  {
    "filename": "school fees for filipino students.docx",
    "chunk": 0,
    "content": "Caloocan Campus School Fees for Filipino Students 1st Sem. 2024-2025 College of Arts and Science: TUITION FEE AND OTHER SCHOOL FEES FOR INCOMING FRESHMEN SECOND SEMESTER SCHOOL YEAR 2024-2025 FILIPINO STUDENT E S T I M A T E PROGRAM NO. OF UNITS FULL PAYMENT UPON ENROLLMENT NET OF DISCOUNT INSTALLMENT SCHEME DOWNPAYMENT MONTHLY INSTALLMENT TOTAL BS in Tourism Management 20 Php 49,548.00 Php 8,500.00 Php 10,695.00 Php 51,280.00 BS in Hospitality Management 20 49,548.00 8,500.00 10,695.00 51,280.00 Bachelor of Arts (A.B.) in Communication 23 55,599.00 8,500.00 12,238.00 57,452.00 BS in Psychology 23 55,599.00 8,500.00 12,238.00 57,452.00 BS in Criminology 20 49,548.00 8,500.00 10,695.00 51,280.00 Note: Installment balance after downpayment is payable in four (4) equal monthly installments (September,October, November, and December) Charges on Cancellation of Registration: Before classes: Processing fee of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus 100% of total school fees Charges on Late Payment of Installment Due Php48.00 per late installment due (cumulative) After the last installment due, 5% of the balance College of Business and Accountancy Administration: TUITION FEE AND OTHER SCHOOL FEES FOR INCOMING FRESHMEN SECOND SEMESTER SCHOOL YEAR 2024-2025 FILIPINO STUDENT E S T I M A T E PROGRAM NO. OF UNITS FULL PAYMENT UPON ENROLLMENT NET OF DISCOUNT INSTALLMENT SCHEME DOWNPAYMENT MONTHLY INSTALLMENT TOTAL BS in Accountancy 26 Php 62,690.00 Php 8,500.00 Php 14,047.25 Php 64,689.00 BS in Management Accounting 26 62,690.00 8,500.00 14,047.25 64,689.00 BSBA - Financial Management 23 53,885.00 8,500.00 11,801.25 55,705.00 BSBA - Business Management 23 53,885.00 8,500.00 11,801.25 55,705.00 BSBA - Marketing Management 23 56,610.00 8,500.00 12,496.25 58,485.00 Note: Installment balance after downpayment is payable in four (4) equal monthly installments September,October, November, and December) Charges on Cancellation of Registration: Before classes: Processing fee of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus 100% of total school fees Charges on Late Payment of Installment Due Php48.00 per late installment due (cumulative) After the last installment due, 5% of the balance College of Engineering: TUITION FEE AND"
  },
  {
    "filename": "school fees for filipino students.docx",
    "chunk": 1,
    "content": "OTHER SCHOOL FEES FOR INCOMING FRESHMEN SECOND SEMESTER SCHOOL YEAR 2024-2025 FILIPINO STUDENT E S T I M A T E PROGRAM NO. OF UNITS FULL PAYMENT UPON ENROLLMENT NET OF DISCOUNT INSTALLMENT SCHEME DOWNPAYMENT MONTHLY INSTALLMENT TOTAL ENGINEERING BS in Civil Engineering 19 Php 48,610.00 Php 8,500.00 Php 10,454.00 Php 50,316.00 BS in Civil Engineering with Bridging Program 23 56,675.00 8,500.00 12,511.25 58,545.00 BS in Computer Engineering 18 50,803.00 8,500.00 11,013.25 52,553.00 BS in Computer Engineering with Bridging Program 22 58,866.00 8,500.00 13,070.25 60,781.00 BS in Electrical Engineering 20 53,664.00 8,500.00 11,743.25 55,473.00 BS in Electrical Engineering with Bridging Program 24 61,729.00 8,500.00 13,800.25 63,701.00 BS in Electronics Engineering 19 53,359.00 8,500.00 11,665.50 55,162.00 BS in Electronics Engineering with Bridging Program 23 61,424.00 8,500.00 13,722.75 63,391.00 BS in Mechanical Engineering 20 52,338.00 8,500.00 11,404.75 54,119.00 BS in Mechanical Engineering with Bridging Program 24 60,402.00 8,500.00 13,462.00 62,348.00 INFORMATION TECHNOLOGY BS in Computer Science 20 52,074.00 8,500.00 11,339.50 53,858.00 BS in Data Science 20 52,074.00 8,500.00 11,339.50 53,858.00 BS in Information Technology 20 52,074.00 8,500.00 11,339.50 53,858.00 Note: Installment balance after downpayment is payable in four (4) equal monthly installments (September,October, November, and December) Charges on Cancellation of Registration: Before classes: Processing fee of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus 100% of total school fees Charges on Late Payment of Installment Due Php48.00 per late installment due (cumulative) After the last installment due, 5% of the balance College of Fine Arts, Architecture and Design TUITION FEE AND OTHER SCHOOL FEES FOR INCOMING FRESHMEN SECOND SEMESTER SCHOOL YEAR 2024-2025 FILIPINO STUDENT E S T I M A T E PROGRAM NO. OF UNITS FULL PAYMENT UPON ENROLLMENT NET OF DISCOUNT INSTALLMENT SCHEME DOWNPAYMENT MONTHLY INSTALLMENT TOTAL BS in Architecture 22 Php 56,414.00 Php 8,500.00 Php 12,446.25 Php 58,285.00 Bachelor of Fine Arts - Visual Communication 24 63,366.00 8,500.00 14,219.75 65,379.00 Bachelor of Fine Arts - Painting 24 63,366.00 8,500.00 14,219.75 65,379.00 BS in Interior Design 24 63,770.00 8,500.00 14,322.50 65,790.00 Bachelor of Multimedia Arts 23 57,812.00 8,500.00 12,802.50 59,710.00 Note: Installment balance after downpayment is payable in four (4) equal monthly installments (September,October, November,and December) Charges on Cancellation of Registration: Before classes: Processing fee"
  },
  {
    "filename": "school fees for filipino students.docx",
    "chunk": 2,
    "content": "of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus 100% of total school fees Charges on Late Payment of Installment Due Php48.00 per late installment due (cumulative) After the last installment due, 5% of the balance Senior High TUITION FEE AND OTHER SCHOOL FEES FOR BASIC EDUCATION DEPARTMENT (SENIOR HIGH SCHOOL ) SCHOOL YEAR 2024-2025 FILIPINO STUDENT E S T I M A T E GRADE LEVEL SEMESTRAL FULL PAYMENT UPON ENROLLMENT NET OF DISCOUNT INSTALLMENT SCHEME NO. OF MONTHS DOWNPAYMENT MONTHLY INSTALLMENT TOTAL REGULAR STUDENTS 1 Month Php 20,000.00 Php 16,261.00 Php 36,261.00 2 Months 16,000.00 10,363.50 36,727.00 FIRST SEMESTER Php 35,365.00 3 Months 8,000.00 9,731.00 37,193.00 4 Months 5,000.00 8,164.50 37,658.00 1 Month 20,000.00 15,116.00 35,116.00 SECOND SEMESTER Php 34,219.00 2 Months 3 Months 16,000.00 8,000.00 9,790.50 9,349.00 35,581.00 36,047.00 GRADE 11 4 Months 5,000.00 7,878.00 36,512.00 SHS-VP PUBLIC FIRST SEMESTER Php 25,011.00 3 Months 4 Months 4,000.00 3,000.00 7,159.00 5,677.50 25,477.00 25,710.00 SECOND SEMESTER Php 23,866.00 3 Months 4,000.00 6,777.00 24,331.00 4 Months 3,000.00 5,391.25 24,565.00 SHS-VP PRIVATE FIRST SEMESTER Php 27,261.00 3 Months 4 Months 4,000.00 3,000.00 7,909.00 6,240.00 27,727.00 27,960.00 SECOND SEMESTER Php 26,116.00 3 Months 4 Months 4,000.00 3,000.00 7,527.00 5,953.75 26,581.00 26,815.00 REGULAR STUDENTS 1 Month 20,000.00 16,642.00 36,642.00 2 Months 16,000.00 10,554.00 37,108.00 FIRST SEMESTER Php 35,739.00 3 Months 8,000.00 9,858.00 37,574.00 4 Months 5,000.00 8,259.75 38,039.00 1 Month 20,000.00 16,649.00 36,649.00 SECOND SEMESTER Php 35,745.00 2 Months 3 Months 16,000.00 8,000.00 10,557.00 9,860.00 37,114.00 37,580.00 GRADE 12 4 Months 5,000.00 8,261.25 38,045.00 SHS-VP PUBLIC FIRST SEMESTER Php 25,392.00 3 Months 4 Months 4,000.00 3,000.00 7,286.00 5,772.75 25,858.00 26,091.00 SECOND SEMESTER Php 25,399.00 3 Months 4 Months 4,000.00 3,000.00 7,288.00 5,774.25 25,864.00 26,097.00 SHS-VP PUBLIC FIRST SEMESTER Php 27,642.00 3 Months 4 Months 4,000.00 3,000.00 8,036.00 6,335.25 28,108.00 28,341.00 SECOND SEMESTER Php 27,649.00 3 Months 4 Months 4,000.00 3,000.00 8,038.00 6,336.75 28,114.00 28,347.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus"
  },
  {
    "filename": "school fees for filipino students.docx",
    "chunk": 3,
    "content": "100% of total school fees Charges on Late Payment of Installment Due Php24.00 per late installment due (cumulative) 30 days after the semester, 10% of the balance Junior High (Science Base) TUITION FEE AND OTHER SCHOOL FEES FOR BASIC EDUCATION DEPARTMENT (JUNIOR HIGH SCHOOL SCIENCE BASED CURRICULUM) SCHOOL YEAR 2024-2025 FILIPINO STUDENT E S T I M A T E GRADE LEVEL FULL PAYMENT UPON ENROLLMENT NET OF DISCOUNT INSTALLMENT SCHEME NO. OF MONTHS DOWNPAYMENT MONTHLY INSTALLMENT TOTAL 3 Months Php 30,000.00 Php 8,057.00 Php 54,171.00 GRADE 7 Php 52,674.00 5 Months 7 Months 20,000.00 10,000.00 7,020.40 6,576.00 55,102.00 56,032.00 9 Months 5,000.00 5,735.00 56,615.00 3 Months 30,000.00 8,057.00 54,171.00 GRADE 8 Php 52,674.00 5 Months 7 Months 20,000.00 10,000.00 7,020.40 6,576.00 55,102.00 56,032.00 9 Months 5,000.00 5,735.00 56,615.00 3 Months 30,000.00 8,057.00 54,171.00 GRADE 9 Php 52,674.00 5 Months 7 Months 20,000.00 10,000.00 7,020.40 6,576.00 55,102.00 56,032.00 9 Months 5,000.00 5,735.00 56,615.00 3 Months 30,000.00 8,521.67 55,565.00 GRADE 10 Php 54,064.00 5 Months 7 Months 20,000.00 10,000.00 7,299.20 6,775.29 56,496.00 57,427.00 9 Months 5,000.00 5,889.89 58,009.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus 100% of total school fees Charges on Late Payment of Installment Due Php24.00 per late installment due (cumulative) 30 days after the school year, 10% of the balance Junior High TUITION FEE AND OTHER SCHOOL FEES FOR BASIC EDUCATION DEPARTMENT ( JUNIOR HIGH SCHOOL) SCHOOL YEAR 2024-2025 FILIPINO STUDENT E S T I M A T E GRADE LEVEL FULL PAYMENT UPON ENROLLMENT NET OF DISCOUNT INSTALLMENT SCHEME NO. OF MONTHS DOWNPAYMENT MONTHLY INSTALLMENT TOTAL 3 Months Php 30,000.00 Php 6,462.33 Php 49,387.00 GRADE 7 Php 47,987.00 5 Months 7 Months 20,000.00 10,000.00 6,063.60 5,892.57 50,318.00 51,248.00 9 Months 5,000.00 5,203.44 51,831.00 3 Months 30,000.00 6,462.33 49,387.00 GRADE 8 Php 47,987.00 5 Months 7 Months 20,000.00 10,000.00 6,063.60 5,892.57 50,318.00 51,248.00 9 Months 5,000.00 5,203.44 51,831.00 3 Months 30,000.00 6,462.33 49,387.00 GRADE 9 Php 47,987.00 5 Months 7 Months 20,000.00 10,000.00 6,063.60 5,892.57 50,318.00 51,248.00 9 Months 5,000.00 5,203.44 51,831.00 3 Months 30,000.00 6,927.00 50,781.00 GRADE 10 Php 49,376.00 5 Months 7 Months 20,000.00 10,000.00 6,342.60 6,091.86 51,713.00 52,643.00"
  },
  {
    "filename": "school fees for filipino students.docx",
    "chunk": 4,
    "content": "9 Months 5,000.00 5,358.33 53,225.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php600.00 plus Php5,000.00 1st week of classes: Processing fees of Php600.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php600.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php600.00 plus 100% of total school fees Charges on Late Payment of Installment Due Php24.00 per late installment due (cumulative) 30 days after the school year, 10% of the balance Elementary: TUITION FEE AND OTHER SCHOOL FEES FOR BASIC EDUCATION DEPARTMENT ( ELEMENTARY) SCHOOL YEAR 2024-2025 FILIPINO STUDENT E S T I M A T E GRADE LEVEL FULL PAYMENT UPON ENROLLMENT NET OF DISCOUNT INSTALLMENT SCHEME NO. OF MONTHS DOWNPAYMENT MONTHLY INSTALLMENT TOTAL 3 Months Php 30,000.00 Php 6,807.67 Php 50,423.00 GRADE 1 Php 49,001.00 5 Months 7 Months 20,000.00 10,000.00 6,271.00 6,040.71 51,355.00 52,285.00 9 Months 5,000.00 5,318.56 52,867.00 3 Months 30,000.00 5,887.33 47,662.00 GRADE 2 Php 46,294.00 5 Months 7 Months 20,000.00 10,000.00 5,718.80 5,646.29 48,594.00 49,524.00 9 Months 5,000.00 5,011.89 50,107.00 3 Months 30,000.00 5,887.33 47,662.00 GRADE 3 Php 46,294.00 5 Months 7 Months 20,000.00 10,000.00 5,718.80 5,646.29 48,594.00 49,524.00 9 Months 5,000.00 5,011.89 50,107.00 3 Months 30,000.00 5,892.67 47,678.00 GRADE 4 Php 46,310.00 5 Months 7 Months 20,000.00 10,000.00 5,722.00 5,648.57 48,610.00 49,540.00 9 Months 5,000.00 5,013.67 50,123.00 3 Months 30,000.00 5,892.67 47,678.00 GRADE 5 Php 46,310.00 5 Months 7 Months 20,000.00 10,000.00 5,722.00 5,648.57 48,610.00 49,540.00 9 Months 5,000.00 5,013.67 50,123.00 3 Months 30,000.00 6,271.00 48,813.00 GRADE 6 Php 47,445.00 5 Months 7 Months 20,000.00 10,000.00 5,949.00 5,810.71 49,745.00 50,675.00 9 Months 5,000.00 5,139.67 51,257.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php600.00 plus Php5,000.00 1st week of classes: Processing fees of Php600.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php600.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php600.00 plus 100% of total school fees Charges on Late Payment of Installment Due Php24.00 per late installment due (cumulative) 30 days after the school year, 10% of the balance Kindergarten TUITION FEE AND OTHER SCHOOL FEES FOR BASIC EDUCATION DEPARTMENT (KINDERGARTEN) SCHOOL YEAR 2024-2025 FILIPINO STUDENT E S T I M A T E LEVEL FULL PAYMENT UPON ENROLLMENT NET OF DISCOUNT INSTALLMENT SCHEME NO. OF MONTHS DOWNPAYMENT MONTHLY"
  },
  {
    "filename": "school fees for filipino students.docx",
    "chunk": 5,
    "content": "INSTALLMENT TOTAL 3 Months Php 30,000.00 Php 12,707.00 Php 68,121.00 KINDERGARTEN 1 Php 66,367.00 5 Months 7 Months 20,000.00 10,000.00 9,810.40 8,568.86 69,052.00 69,982.00 9 Months 5,000.00 7,285.00 70,565.00 3 Months 30,000.00 12,707.00 68,121.00 KINDERGARTEN 2 Php 66,367.00 5 Months 7 Months 20,000.00 10,000.00 9,810.40 8,568.86 69,052.00 69,982.00 9 Months 5,000.00 7,285.00 70,565.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php600.00 plus Php5,000.00 1st week of classes: Processing fees of Php600.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php600.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php600.00 plus 100% of total school fees Charges on Late Payment of Installment Due Php24.00 per late installment due (cumulative) 30 days after the school year, 10% of the balance"
  },
  {
    "filename": "SCHOOL FEES FOR INTERNATIONAL STUDENTS.docx",
    "chunk": 0,
    "content": "Caloocan Campus School Fees for International Students 1st Sem. 2024-2025 College of Engineering (COE) TUITION FEE AND OTHER SCHOOL FEES FOR INCOMING FRESHMEN FIRST SEMESTER SCHOOL YEAR 2024-2025 INTERNATIONAL STUDENT E S T I M A T E PROGRAM NO. OF UNITS FULL PAYMENT UPON ENROLLMENT ACCEPTANCE FEE SERVICE FEE ENGINEERING BS in Civil Engineering 16 Php 55,779.00 USD 125.00 USD 75.00 BS in Civil Engineering with Bridging Program 20 65,652.00 125.00 75.00 BS in Computer Engineering 15 58,462.00 125.00 75.00 BS in Computer Engineering with Bridging Program 19 68,337.00 125.00 75.00 BS in Electrical Engineering 17 61,967.00 125.00 75.00 BS in Electrical Engineering with Bridging Program 21 71,840.00 125.00 75.00 BS in Electronics Engineering 16 61,594.00 125.00 75.00 BS in Electronics Engineering with Bridging Program 20 71,467.00 125.00 75.00 BS in Mechanical Engineering 17 60,343.00 125.00 75.00 BS in Mechanical Engineering with Bridging Program 21 70,216.00 125.00 75.00 INFORMATION TECHNOLOGY BS in Computer Science 17 60,028.00 125.00 75.00 BS-Data Science 17 60,028.00 125.00 75.00 BS in Information Technology 17 60,028.00 125.00 75.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus 100% of total school fees College of Business Administration (CBA) TUITION FEE AND OTHER SCHOOL FEES FOR INCOMING FRESHMEN FIRST SEMESTER SCHOOL YEAR 2024-2025 INTERNATIONAL STUDENT E S T I M A T E PROGRAM NO. OF UNITS FULL PAYMENT UPON ENROLLMENT ACCEPTANCE FEE SERVICE FEE BS in Accountancy 23 Php 73,025.00 USD 125.00 USD 75.00 BS in Management Accounting 23 73,025.00 125.00 75.00 BSBA - Financial Management 20 62,245.00 125.00 75.00 BSBA - Business Management 20 62,245.00 125.00 75.00 BSBA - Marketing Management 20 65,581.00 125.00 75.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus 100% of total school fees College Of Arts and Sciences (CAS) TUITION FEE AND OTHER SCHOOL FEES FOR INCOMING FRESHMEN FIRST SEMESTER SCHOOL YEAR 2024-2025 INTERNATIONAL STUDENT E S T I"
  },
  {
    "filename": "SCHOOL FEES FOR INTERNATIONAL STUDENTS.docx",
    "chunk": 1,
    "content": "M A T E PROGRAM NO. OF UNITS FULL PAYMENT UPON ENROLLMENT ACCEPTANCE FEE SERVICE FEE BS in Tourism Managementt 17 Php 56,935.00 USD 125.00 USD 75.00 BS in Hospitality Management 17 56,935.00 125.00 75.00 Bachelor of Arts (A.B.) in Communication 20 64,341.00 125.00 75.00 BS in Psychology 20 64,341.00 125.00 75.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus 100% of total school fees College of Fine Arts, Architecture and Design (CFAD) TUITION FEE AND OTHER SCHOOL FEES FOR INCOMING FRESHMEN FIRST SEMESTER SCHOOL YEAR 2024-2025 INTERNATIONAL STUDENT E S T I M A T E PROGRAM NO. OF UNITS FULL PAYMENT UPON ENROLLMENT ACCEPTANCE FEE SERVICE FEE BS-Architecture 19 Php 65,340.00 USD 125.00 USD 75.00 Bachelor of Fine Arts - Visual Communication 21 73,854.00 125.00 75.00 Bachelor of Fine Arts - Painting 21 73,854.00 125.00 75.00 BS Interior Design 21 74,347.00 125.00 75.00 Bachelor of Multimedia Arts 20 67,051.00 125.00 75.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus 100% of total school fees Basic Education Department Basic Education Kindergarten TUITION FEE AND OTHER SCHOOL FEES FOR BASIC EDUCATION DEPARTMENT (KINDERGARTEN) SCHOOL YEAR 2024-2025 INTERNATIONAL STUDENT E S T I M A T E LEVEL FULL PAYMENT UPON ENROLLMENT ACCEPTANCE FEE SERVICE FEE KINDERGARTEN 1 Php 81,187.00 USD 125.00 USD 75.00 KINDERGARTEN 2 81,187.00 125.00 75.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php600.00 plus Php5,000.00 1st week of classes: Processing fees of Php600.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php600.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php600.00 plus 100% of total school fees TUITION FEE AND OTHER SCHOOL FEES FOR BASIC EDUCATION DEPARTMENT ( ELEMENTARY) SCHOOL YEAR 2024-2025 INTERNATIONAL STUDENT E S T I M A T E ELEMENTARY DEPARTMENT (GRADE LEVEL) FULL PAYMENT"
  },
  {
    "filename": "SCHOOL FEES FOR INTERNATIONAL STUDENTS.docx",
    "chunk": 2,
    "content": "UPON ENROLLMENT ACCEPTANCE FEE SERVICE FEE GRADE 1 Php 59,950.00 USD 125.00 USD 75.00 GRADE 2 56,638.00 125.00 75.00 GRADE 3 56,638.00 125.00 75.00 GRADE 4 56,657.00 125.00 75.00 GRADE 5 56,657.00 125.00 75.00 GRADE 6 58,018.00 125.00 75.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php600.00 plus Php5,000.00 1st week of classes: Processing fees of Php600.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php600.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php600.00 plus 100% of total school fees Basic Education Department Elementary Basic Education Junior High School TUITION FEE AND OTHER SCHOOL FEES FOR BASIC EDUCATION DEPARTMENT ( JUNIOR HIGH SCHOOL) SCHOOL YEAR 2024-2025 INTERNATIONAL STUDENT E S T I M A T E GRADE LEVEL FULL PAYMENT UPON ENROLLMENT ACCEPTANCE FEE SERVICE FEE GRADE 7 Php 58,707.00 USD 125.00 USD 75.00 GRADE 8 58,707.00 125.00 75.00 GRADE 9 58,707.00 125.00 75.00 GRADE 10 60,380.00 125.00 75.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php600.00 plus Php5,000.00 1st week of classes: Processing fees of Php600.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php600.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php600.00 plus 100% of total school fees Basic Education Junior High School Science Based TUITION FEE AND OTHER SCHOOL FEES FOR BASIC EDUCATION DEPARTMENT (JUNIOR HIGH SCHOOL SCIENCE BASED CURRICULUM) SCHOOL YEAR 2024-2025 INTERNATIONAL STUDENT E S T I M A T E GRADE LEVEL FULL PAYMENT UPON ENROLLMENT ACCEPTANCE FEE SERVICE FEE GRADE 7 Php 64,447.00 USD 125.00 USD 75.00 GRADE 8 64,447.00 125.00 75.00 GRADE 9 64,447.00 125.00 75.00 GRADE 10 66,120.00 125.00 75.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php600.00 plus Php5,000.00 1st week of classes: Processing fees of Php600.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php600.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php600.00 plus 100% of total school fees Basic Education Senior High School TUITION FEE AND OTHER SCHOOL FEES FOR BASIC EDUCATION DEPARTMENT (SENIOR HIGH SCHOOL ) SCHOOL YEAR 2024-2025 INTERNATIONAL STUDENT E S T I M A T E GRADE LEVEL SEMESTRAL FULL PAYMENT UPON ENROLLMENT ACCEPTANCE FEE SERVICE FEE GRADE 11 FIRST"
  },
  {
    "filename": "SCHOOL FEES FOR INTERNATIONAL STUDENTS.docx",
    "chunk": 3,
    "content": "SEMESTER Php 43,236.00 USD 125.00 USD 75.00 SECOND SEMESTER 41,861.00 125.00 75.00 GRADE 12 FIRST SEMESTER 43,693.00 125.00 75.00 SECOND SEMESTER 43,700.00 125.00 75.00 Note: Charges on Cancellation of Registration: Before classes: Processing fee of Php300.00 plus Php5,000.00 1st week of classes: Processing fees of Php300.00 plus 25% of total school fees 2nd week of classes: Processing fee of Php300.00 plus 50% of total school fees 3rd week of classes and so on: Processing fee of Php300.00 plus 100% of total school fees"
  },
  {
    "filename": "shs school calendar.docx",
    "chunk": 0,
    "content": "Basic Education Department – Senior High School First and Second Semester of School Year 2024- 2025 Caloocan Campuse – Grade 11 and Grade 12 ADMISSION & REGISTRATION SCHEDULE First Sem. 2024-2025 Second Sem. 2024- 2025 :: ADMISSION Freshmen( Grade 11) Students June 18 – August 01, 2024 Transferees July 01 – August 01, 2024 January 06 – 13, 2025 :: REGISTRATION Freshmen( Grade 11) Students June 18 – August 01, 2024 Old Students July 01 – August 01, 2024 January 03 – 15, 2025 Last Day of Regular Registration August 01 (Th), 2024 January 13(M), 2025 SCHOOL CALENDAR First Sem. 2024-2025 Second Sem. 2024- 2025 FIRST DAY OF REGULAR CLASSES August 01 (Th), 2024 January 13 (M), 2025 :: PERIODIC EXAMINATIONS First Periodic Examination October 09 – 11, 2024 March 05 – 07, 2025 Deadline for Posting of First Periodic Grades October 25 (F), 2024 March 21 (F), 2025 Second Periodic Examination December 09 – 11, 2024 April 29, 30 & May 02, 2025 Deadline for Posting of Second Periodic Grades December 18 (W), 2024 May 09 (F), 2025 :: HOLIDAY BREAKS Observance of All Saints’ Day November 01 (F), 2024 Observance of All Souls’ Day November 02 (S), 2024 Observance of Holy Week April 17 – 20, 2025 :: LAST RECITATION DAY MWF Classes December 06 (F), 2024 April 28 (M), 2025 T-Th Classes December 05 (Th), 2024 April 24 (Th), 2025 LAST DAY OF THE SEMESTER December 18 (W), 2024 May 09 (F), 2025 OTHERS MANILA CAMPUS CALOOCAN CAMPUS FACULTY INSET Last week of July 2024 & First week of January 2025 Last week of July 2024 & First week of January 2025 PARENT-TEACHERS CONFERENCE (PTC) After posting of periodic grades After posting of periodic grades Recognition Ceremonies – G11 Last week of May 2025 Last week of May 2025 Thanksgiving Ceremonies (Ecumenical) – G12 1st week of June 2025 1st week of June 2025 SHS Graduation 1st week of June 2025 1st week of June 2025 SUMMER 2024 Caloocan Campuse – Grade 11 and Grade 12 SCHEDULE OF ADMISSION Cross Registrants June 04 (T) – June 13 (Th) SCHEDULE OF REGISTRATION Cross Registrants June 04 (T) – June 13 (Th) Old Students June 04 (M) – June 13 (Th) SCHOOL CALENDAR FIRST DAY OF REGULAR CLASSES June 13 (Th) LAST RECITATION DAY July 18 (Th) FINAL EXAMINATIONS July 19 (F) DEADLINE FOR POSTING OF STUDENTS’ FINAL GRADES"
  },
  {
    "filename": "shs school calendar.docx",
    "chunk": 1,
    "content": "July 26 (F) DISTRIBUTION OF CERTIFICATE OF RCM July 26 (F)"
  },
  {
    "filename": "The Guidance, Counseling and Career Services Office.docx",
    "chunk": 0,
    "content": "The Guidance, Counseling, and Career Services Office The Guidance, Counseling, and Career Services Office is dedicated to the holistic development of students, aiming to improve their adjustment to both their environment and society. The office plays a crucial role in fostering a supportive atmosphere for intellectual development while also addressing the individual needs of students. It strives to support students' overall growth, including personal, academic, and professional aspects, ensuring that they are well-prepared for future challenges. The office envisions providing students with opportunities for personal integration, academic excellence, and professional advancement, with an emphasis on community awareness, cultural values, and social responsibility. This mission aims to strengthen students' national identity and promote their engagement in societal issues. Services Offered: Orientation for freshmen Individualized Student Records Testing and Placement Counseling Group Guidance Consultation and Referral Enrichment Programs Career Guidance Programs These services are designed to support the students' personal growth and readiness for future academic and professional endeavors. Visit Us:The office is located on the Ground Floor of the IT Building. Feel free to drop by for assistance or more information!"
  },
  {
    "filename": "trunklines.docx",
    "chunk": 0,
    "content": "1. What are the trunklines?: Caloocan Campus: (632) 8367-45-72 DEPARTMENTS LOCAL DIRECT LINE Admission loc 160 5-310-4548 Admission Mobile no.: 0936-904-3152 (Globe)Admission Mobile no.: 0921-927-1537 (Smart) Alumni loc 163 Basic Education Department loc 202 8366-5848 Cash loc 158 8367-4843 / 5310 4549 Comptroller loc 157 8364-2472 Guidance and Counseling loc 175 8365-4124 Internal Auditing loc 185 8364-2498 Libraries loc 604 8363-6649 » Circulation Section loc 603 » Reference Section loc 602 » Engineering Library loc 183 8365-5453 » MPH loc 182 Environmental Services loc 165 Engineering loc 101 IT Department loc 162 8361-2396 / 8364-4230 IT Department (Internet Room) loc 174 8364-2669 Medical / Dental Clinic loc 179 8363-4936 Meeting Room loc 201 Multi-Purpose loc 182 Physical Education 8365-4594 Property loc 164 8365-4114 Principal loc 202 Printing loc 168 Registrar (DRRM) loc 161 / 184 8364-2601 / 5310 4550 Security loc 222 8363-8874 / 5310 4553 Student Affairs (SAO) loc 176 8364-2499 / 5310 4551 Stocks and Receiving loc 178 5310 4554 COLLEGES LOCAL DIRECT LINE Arts and Sciences loc 303 8364-1497 CAS Dean loc 306 CAS Associate Dean 1 loc 304/305 CAS Associate Dean 2 loc 304 CAS College Secretary loc 302 CAS Department Chair loc 301 CAS Faculty loc 401 College of Business Administration loc 102 8362-2907 CBA Dean loc 105 8365-5930 CBA Associate Dean 1 loc 104/106 CBA Associate Dean 2 loc 106 CBA College Secretary loc 103 CBA Department Chair loc 107 CBA Staff loc 102 CBA Faculty loc 108 Fine Arts, Architecture & Design (CFAD) loc 504 CFAD Dean loc 507 CFAD College Secretary loc 503 CFAD Staff Loc 504 CFAD Faculty loc 501 College of Engineering 8365-4121 Engr. Dean loc 166 Engr. College Secretary loc 167 Civil Engineering loc 171 Computer Engineering loc 172 Electronics Communication Engineering loc 181 Electrical Engineering loc 170 Mechanical Engineering loc 169 EXECUTIVE OFFICE LOCAL DIRECT LINE Chancellor’s Office loc 159 8364-2659 / 5310 4547"
  },
  {
    "filename": "UE Department of Registration and Records Management.docx",
    "chunk": 0,
    "content": "UE Department of Registration and Records Management (DRRM) The UE Department of Registration and Records Management (DRRM) oversees the University’s policies regarding student enrollment, transfers, and graduation. They are responsible for managing student records, and preparing transcripts, certificates, diplomas, and other related documents. The DRRM also organizes commencement and other university-related ceremonies. For UE graduates and alumni:You may apply online for your diploma, transcript of records, certificate of English as the medium of instruction, certificate of honorable dismissal, and other related documents (except for the certificate of good moral character). To do so, fill out the Google Form provided by the DRRM, available for each UE campus: UE Caloocan: https://docs.google.com/forms/d/16YHlZMp_laZ8WbMT0hG2_WmCkabLbJO4tVaah5JcZSQ Processing time for requests, including clearances with other UE offices and payment validation, typically takes 15-20 working days. During this period, the DRRM will send an email with payment options and information on claiming or delivery dates. On-campus clearances will be handled by the DRRM on the alumnus' or graduate’s behalf, with guidance on any clearance-related issues. Office hours for contacting DRRM:You can reach the DRRM by phone during these hours: Office hours: Monday to Friday, 8:00 AM - 12:00 PM & 1:00 PM - 5:00 PM (non-holidays) UE Caloocan Contact: (632) 8-367-4572 local 184 or (632) 8-364-2601 Email: drrm.cal@ue.edu.ph Note:The certificate of good moral character for UE alumni and graduates is requested through the Student Affairs Office. Contact them at sao.cal@ue.edu.ph."
  },
  {
    "filename": "UE FORMS LINK.docx",
    "chunk": 0,
    "content": "UE Forms Link: https://www.ue.edu.ph/mla/ue-forms/ This link provides access to a variety of forms, including: Admission Forms DRRM Forms I.T. Forms Office of Research Coordination (ORC) Forms Library Forms Once redirected to the page, simply click on the form you need and fill it out."
  },
  {
    "filename": "UE HYMN.docx",
    "chunk": 0,
    "content": "UE HYMN Pamantasan ka naming mahal Ilaw sa karimlan Buhay, lakas, dunong, dangal Pamantasan ka ng bayan. Ang pangalan mo ay Lualhati At sandigan ka ng lahi Pamantasan ng Silangan Pamantasan ka naming mahal."
  },
  {
    "filename": "UE PORTAL.docx",
    "chunk": 0,
    "content": "How to Access Features and Information via the UE Portal Student Information: Log in to the UE Portal and navigate to Student Info. Click Student Information to access details such as PME results and your ledger. Grades: Go to the Academics section in the UE Portal and click Grades. You can also view the curriculum template, class schedule, and evaluation here. Online Resources: Navigate to Online Resources in the portal to access: Google Mail Canvas LMS MS Office 365 Library Resources Online Transactions: Go to the Online Transactions section in the portal for services like: iEnroll Dissolved Class Apply for Student ID Invalidation of Registration Cancellation of Registration Dropping of Subjects Removal of LFR Mark Online Payment Apply for Refund Guidance Office Services: Go to the Guidance Office Services section in the portal to access: Needs Assessment Survey Counseling Sessions Job Listings Surveys: Find the Surveys section in the portal, where you can answer: WebSEFP (Faculty) Survey University Services Survey COVID-19 Survey Registration Form: Go to the Downloads section in the portal and download the registration form. Proof of Payment: Click the Proof of Payment section in the portal to view your payment receipts. Downloadable Forms: Navigate to the Forms section to download various required forms. Student Class Schedule: Access your class schedule by clicking Dashboard and then selecting Class Schedule. Grades: View your grades by going to Dashboard and clicking Grades. Student Manual: Access the student manual under Dashboard by selecting Student Manual. Current Balance: Check your current balance by going to Dashboard and clicking Student Balance."
  },
  {
    "filename": "UE Student Council.docx",
    "chunk": 0,
    "content": "STUDENT COUNCIL IN UE CALOOCAN ACADEMIC YEAR 2024-2025 UE-Caloocan Central Student Council Officers(CSC) for Academic Year 2024-2025 𝐂𝐒𝐂 𝐏𝐑𝐄𝐒𝐈𝐃𝐄𝐍𝐓 Karylle Mae Macorol cscpresident.uecal2425@gmail.com 𝐂𝐒𝐂 𝐕𝐈𝐂𝐄 𝐏𝐑𝐄𝐒𝐈𝐃𝐄𝐍𝐓 Carl Vincent Ocampo cscvicepresident.uecal2425@gmail.com 𝐂𝐒𝐂 𝐒𝐄𝐂𝐑𝐄𝐓𝐀𝐑𝐘 Precious Ann Uy cscsecretary.uecal2425@gmail.com 𝐂𝐒𝐂 𝐓𝐑𝐄𝐀𝐒𝐔𝐑𝐄𝐑 Vinson Anthony Manaois csctreasurer.uecal2425@gmail.com 𝐂𝐒𝐂 𝐀𝐔𝐃𝐈𝐓𝐎𝐑 Hazel Gayle Barroa cscauditor.uecal2425@gmail.com 𝐂𝐒𝐂 𝐁𝐔𝐒𝐈𝐍𝐄𝐒𝐒 𝐌𝐀𝐍𝐀𝐆𝐄𝐑 Angelo Khert Carreon csc.businessmanager.uecal2425@gmail.com 𝐂𝐒𝐂 𝐏𝐔𝐁𝐋𝐈𝐂 𝐑𝐄𝐋𝐀𝐓𝐈𝐎𝐍𝐒 𝐎𝐅𝐅𝐈𝐂𝐄𝐑 Stephanie Leigh Chua cscpro.uecal2425@gmail.com Office of the UE-Caloocan Arts and Sciences Student Council(CASSC) for Academic Year 2024-2025 𝐏𝐑𝐄𝐒𝐈𝐃𝐄𝐍𝐓: Antonia Buyser buyser.antonia@ue.edu.ph 𝐕𝐈𝐂𝐄 𝐏𝐑𝐄𝐒𝐈𝐃𝐄𝐍𝐓: Jazyl Divinagracia divinagracia.jazyl@ue.edu.ph 𝐒𝐄𝐂𝐑𝐄𝐓𝐀𝐑𝐘: Hannah Kirsten Dizon dizon.hannahkirsten@ue.edu.ph 𝐓𝐑𝐄𝐀𝐒𝐔𝐑𝐄𝐑: Richard Rey Navia navia.richardrey@ue.edu.ph 𝐀𝐔𝐃𝐈𝐓𝐎𝐑: Akielah Azarcon azarcon.akielah@ue.edu.ph 𝐁𝐔𝐒𝐈𝐍𝐄𝐒𝐒 𝐌𝐀𝐍𝐀𝐆𝐄𝐑: Geanna Vinace Dela Cruz delacruz.geannavinace@ue.edu.ph 𝐏𝐔𝐁𝐋𝐈𝐂 𝐑𝐄𝐋𝐀𝐓𝐈𝐎𝐍𝐒 𝐎𝐅𝐅𝐈𝐂𝐄𝐑: Yves Nathan Tumbocon tumbocon.yvesnathan@ue.edu.ph 𝟒𝐓𝐇 𝐘𝐄𝐀𝐑 𝐑𝐄𝐏𝐑𝐄𝐒𝐄𝐍𝐓𝐀𝐓𝐈𝐕𝐄: John Lester Estavillo estavillo.lester@ue.edu.ph 𝟑𝐑𝐃 𝐘𝐄𝐀𝐑 𝐑𝐄𝐏𝐑𝐄𝐒𝐄𝐍𝐓𝐀𝐓𝐈𝐕𝐄: Katrina Coline Bernardo bernardo.katrinacoline@ue.edu.ph 𝟐𝐍𝐃 𝐘𝐄𝐀𝐑 𝐑𝐄𝐏𝐑𝐄𝐒𝐄𝐍𝐓𝐀𝐓𝐈𝐕𝐄: Rence Maureen Mendoza mendoza.rencemaureen@ue.edu.ph 𝟏𝐒𝐓 𝐘𝐄𝐀𝐑 𝐑𝐄𝐏𝐑𝐄𝐒𝐄𝐍𝐓𝐀𝐓𝐈𝐕𝐄: Shaira Quinncy Salcedo salcedo.shairaquinncy@ue.edu.ph 𝐀𝐃𝐕𝐈𝐒𝐄𝐑: Dr. Efren C. Gimoto 𝗖𝗔𝗦𝗦𝗖 𝗘-𝗺𝗮𝗶𝗹: ue.cassc.cal@gmail.com Office of the UE-Caloocan Business Administration(CBASC) Student Council for Academic Year 2024-2025 𝐏𝐑𝐄𝐒𝐈𝐃𝐄𝐍𝐓: Angel T. Cezar 𝐕𝐈𝐂𝐄 𝐏𝐑𝐄𝐒𝐈𝐃𝐄𝐍𝐓: Czayrina Mae M. Anicete 𝐒𝐄𝐂𝐑𝐄𝐓𝐀𝐑𝐘: Althea Necka H. Etchon 𝐓𝐑𝐄𝐀𝐒𝐔𝐑𝐄𝐑: Daniela L. Kiang 𝐀𝐔𝐃𝐈𝐓𝐎𝐑: Sohayah M. Macaraob 𝐏𝐔𝐁𝐋𝐈𝐂 𝐑𝐄𝐋𝐀𝐓𝐈𝐎𝐍𝐒 𝐎𝐅𝐅𝐈𝐂𝐄𝐑: Lhaiza V. Nishikawa 𝐁𝐔𝐒𝐈𝐍𝐄𝐒𝐒 𝐌𝐀𝐍𝐀𝐆𝐄𝐑: Mary Margarette R. Gionson 𝟒𝐓𝐇 𝐘𝐄𝐀𝐑 𝐑𝐄𝐏𝐑𝐄𝐒𝐄𝐍𝐓𝐀𝐓𝐈𝐕𝐄: David Michael A. Co 𝟑𝐑𝐃 𝐘𝐄𝐀𝐑 𝐑𝐄𝐏𝐑𝐄𝐒𝐄𝐍𝐓𝐀𝐓𝐈𝐕𝐄: Joshua D. Reyes 𝟐𝐍𝐃 𝐘𝐄𝐀𝐑 𝐑𝐄𝐏𝐑𝐄𝐒𝐄𝐍𝐓𝐀𝐓𝐈𝐕𝐄: Tristan Kiel M. Zara Office of the UE-Caloocan Fine Arts, Architecture & Design Student Council(CFADSC) for Academic Year 2024-2025 🔵 President: Erickvae B. Ricafort 🔵 Vice President: Virginia P. Quanico 🔵 Secretary: Nicole Jane C. Macasa 🔵 Treasurer: Ma. Amyline C. Lopez 🔵 Auditor: Sean Jhae Kennedy Martinez 🔵 Business Manager: Jim Ruzzle S. Boado 🔵 Public Relations Officer: Miguel Alexis Valentin 🔵 5th Year Representative: Marion Dexter L. Nacianceno 🔵 4th Year Representative: Justine J. Padilla 🔵 3rd Year Representative: Renz Gabriel V. Abilon 🔵 2nd Year Representative: Jetro Lance Miguel Meneses 🔵 1st Year Representative: Louie Cel D.Bongcayao Office of the UE-Caloocan College of (𝗘𝗡SC)Engineering Student Council for Academic Year 2024-2025 𝗘𝗡𝗦𝗖 𝗘𝘅𝗲𝗰𝘂𝘁𝗶𝘃𝗲 𝗢𝗳𝗳𝗶𝗰𝗲𝗿𝘀 𝗔.𝗬. 𝟮𝟬𝟮𝟰-𝟮𝟬𝟮𝟱 President: Charlize Maree L. Pe Vice President: Micaela C. Pimentel Secretary: Bridgieth Kelcey M. Cruz Treasurer: Eizebelle Franxine R. Geronimo Auditor: Keizel A. Matsubara Business Manager: Paulhan Raphael C. Cacnio Public Relations Officer: Elvia Fhae D. Vicente 4th Year Representative: Kervie I. Pablo 3rd Year Representative: Justin N. Pangan 2nd Year Representative: John Derick S. Francisco Adviser: Engr. John Rei Gomez"
  },
  {
    "filename": "UE STUDENT PORTAL RELATED.docx",
    "chunk": 0,
    "content": "Process for the Online Application for Removal of an LFR Mark Initiation: All communications are conducted via the official UE email account. Form Completion: The student downloads the Application Form for Removal of an LFR Mark from the Student Portal. The form is filled out with the required details. Payment: The student pays the application fee using GCash or designated online banking services. Submission: The accomplished form, along with proof of payment, is emailed to the Dean. Dean’s Role: The Dean, through the Department Chairperson, informs the relevant faculty member of the student’s application for further action. If the faculty member is no longer with the University, the Department Chairperson assumes responsibility for facilitating the process. Faculty/Department Chairperson's Action: The faculty member (or Department Chairperson) communicates with the student and arranges necessary activities, such as removal examinations or completion of final requirements listed in the class record. Submission of Documents: The faculty member or Department Chairperson submits the completed application form, corrected examination papers, or final requirement documentation to the Dean within five (5) calendar days. Dean’s Verification: The Dean forwards the signed application form in PDF format, along with the student’s proof of payment, to the Comptroller’s Department. Cashier’s Role: The Cashier issues an official receipt to the student and informs the Comptroller’s Department of the updated status. Final Validation: The Comptroller’s Department validates the student’s account and distributes copies of the verified application form to the following recipients: Dean DRRM (Department for Records and Registration Management) Student Faculty Procedure for Online Dropping of UE College Subjects Log In: Access the UE Student Portal at https://www.ue.edu.ph/portals/sp/login.php. Initiate Transaction: On the Student Portal Dashboard, go to the \"Online Transactions\" section and select \"Dropping of Subjects.\" Select Subjects: Choose the subject(s) you wish to drop. Confirm Selection: Review your selected subject(s), click the Submit button, and confirm the transaction. Email Confirmation: Take a screenshot of your confirmed transaction. Email it to your College using the subject line: Requesting for Dropping of Subject/s of [your name and UE student number]. Include a polite message explaining your reason(s) for dropping the subject(s). Find your College’s specific email address here: UE Directory. Wait for Approval: Monitor your Student Portal for updates. Within a few working days, a message will appear on your Dashboard if your request is approved by the Dean. The message will prompt you to pay the dropping fee. Payment Process: Pay"
  },
  {
    "filename": "UE STUDENT PORTAL RELATED.docx",
    "chunk": 1,
    "content": "the dropping fee of ₱30 per subject using one of the following methods: On-campus cashier (Monday–Thursday, 8:00 AM–12:00 NN or 1:00–4:00 PM). Online via PNB or GCash. After payment, email your proof of payment to finance@ue.edu.ph with the subject: Payment for Dropping of Subject/s of [your name and UE student number]. In the email, include the transaction number from your dropping application. Final Validation: Once the Finance Office validates your payment, the dropped subject(s) will be marked as \"Officially Dropped\" on your Portal Dashboard. Flowchart for Online Request for Changing of Subjects Download and Complete the Form: The student logs in to the Student Portal, downloads the Request Form for Changing of Subjects, and fills out the required details. Submission for Approval: The student emails the completed form to the Dean for approval using the official UE email account. Processing the Change: Once approved, the Associate Dean or College Secretary encodes the subject change and forwards a copy to the Student Account Section via email, with the Department for Records and Registration Management (DRRM) in CC. Account Adjustment Review: The Student Account Section reviews the request for possible account adjustments and sends a notice of payment for the processing fee to the student. Payment Submission: The student submits proof of payment to the Finance Office for validation via email. Finalization: Upon payment validation, the requested subject change is electronically reflected in the student's records. Procedure for the Issuance/Replacement of a New UE Student ID Download and Fill Out the Form: Log in to your Student Portal and click on the \"Downloadable Form\" icon. Download and complete the Official Declaration Form for the Issuance of New ID. If the student is under 18, the Parent Consent section of the form must also be completed. Submit Requirements: Send the completed form to sao.cal@ue.edu.ph along with the following: Proof of payment Recent photo Digital signature Emergency contact details (formatted as below): Name: Address: Contact Number(s): Acknowledgment: The Student Affairs Office (SAO) will email confirmation that the application and proof of payment have been received. The SAO will send a screenshot of the student ID for verification. Claiming the ID: For the schedule and details on claiming the official ID, contact itd.cal@ue.edu.ph. Payment Options: Option 1: PNB Over-the-Counter At PNB, fill out a Bills Payment slip: Company Name: University of the East Reference Number: Your UE Student Number Payor Name: Your full name Submit"
  },
  {
    "filename": "UE STUDENT PORTAL RELATED.docx",
    "chunk": 2,
    "content": "the slip to the teller and request the blue duplicate. Scan or take a photo of the validated duplicate and email it to sao.cal@ue.edu.ph. Option 2: GCash Log in to your GCash account and select Pay Bills. Choose School and then select UE. Enter your 11-digit UE Student Number as the Account Number and the payment amount. Confirm the transaction and take a screenshot of the receipt. Email the screenshot to sao.cal@ue.edu.ph. Option 3: BancNet ATM/Online Log in to your BancNet Online Banking account. Select Pay Bills and choose University of the East or UE as the Biller. Input your 11-digit UE Student Number as the Account Number and the payment amount. Confirm the transaction and take a screenshot of the receipt. Email the screenshot to sao.cal@ue.edu.ph. Payment Validation: Note that receipt validation may take longer than usual due to the ongoing GCQ (General Community Quarantine). Retain a copy of your proof of payment for future reference. Procedure for Issuance of Certificate of No Record of Misconduct Download and Complete the Application Form: Log in to your Student Portal and click the \"Downloadable Form\" icon. Download the Application Form for the Issuance of Certification and fill it out. Submit the Form: Send the completed form via your UE email account to sao.cal@ue.edu.ph. Verification Process: The Student Affairs Office (SAO) will forward the form to the Comptroller’s Office for clearance and verification of records. The SAO will email you regarding the status of your application. Payment: If you have no record of misconduct, the SAO will advise you to pay the required fee and submit proof of payment for processing. Issuance of Certificate: The SAO will email a PDF version of the Certificate of No Record of Misconduct (with a watermark) to you. The email will also indicate when and where to claim the official hardcopy. Claiming the Hardcopy: Pick up the official hardcopy of the certificate at the SAO on the specified date. Payment Options: Option 1: PNB Over-the-Counter At PNB, fill out a Bills Payment Slip with: Company Name: University of the East Reference Number: Your UE Student Number Payor Name: Your full name Submit the slip to the teller and request the blue duplicate. Take a photo or scan the duplicate (with the bank validation print visible) and email it to sao.cal@ue.edu.ph. Option 2: GCash Log in to your GCash account and select Pay Bills. Choose School, then"
  },
  {
    "filename": "UE STUDENT PORTAL RELATED.docx",
    "chunk": 3,
    "content": "select UE. Enter your 11-digit UE Student Number as the Account Number and the payment amount. Confirm the transaction and take a screenshot of the successful payment. Email the screenshot to sao.cal@ue.edu.ph. Option 3: BancNet ATM/Online Log in to your BancNet Online Banking account. Select Pay Bills and choose University of the East (UE) as the Biller. Enter your 11-digit UE Student Number as the Account Number and the payment amount. Confirm the transaction and take a screenshot of the receipt. Email the screenshot to sao.cal@ue.edu.ph. Important Note: Due to the ongoing GCQ, receipt validation may take longer than usual. Retain a copy of your proof of payment for future reference."
  },
  {
    "filename": "University Relation Office.docx",
    "chunk": 0,
    "content": "University Relation Office University Relations Office (URO) The University Relations Office (URO) oversees the preparation and publication of materials that support the University’s communication efforts. It manages the production of UE News, a platform for news and updates, and UE Today, a monthly journal featuring relevant topics, personality highlights, and other matters of interest to the UE community. Additionally, the University Relations Office (URO) produces the official university yearbook, Panorama, as well as the Annual Report for shareholders, the Prospectus, the Student Handbook, and promotional materials like brochures, flyers, and handbooks for various colleges and offices on both the Manila and Caloocan campuses. The University Relations Office (URO) also handles institutional advertising, press releases, and public information campaigns to promote UE and its services. It creates special publications as needed by university management."
  }
]